import 'dart:ui' as prefix0;

import 'package:flutter/material.dart';
class Anbiaa extends StatelessWidget {
  Color color=Colors.red;
  @override
  Widget build(BuildContext context) {
    return Scaffold(
       backgroundColor: Colors.blue[200],
       appBar: AppBar(
       backgroundColor: Colors.blue[900],
          centerTitle: true,

          title: Text('قصص الانبياء',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,color: Colors.white),),
        ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(top: 20,bottom: 20),
        child: ListView(
          children: <Widget>[
            Column(
              children: <Widget>[
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Adam');
                    },
                    child:Text('  ادم عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Nouh');
                    },
                    child:Text('سيدنا نوح عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Ibrahem2');
                    },
                    child:Text('سيدنا ابراهيم عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Ismaeel');
                    },
                    child:Text('سيدنا اسماعيل عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Mousa');
                    },
                    child:Text('سيدنا موسي عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Mohamed2');
                    },
                    child:Text('سيدنا محمد عليه الصلاة والسلام',style:TextStyle(fontSize: 20,fontWeight: prefix0.FontWeight.bold,) ,
                       textDirection: TextDirection.rtl,
                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Yousof');
                    },
                    child:Text('سيدنا يوسف عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Yaqob');
                    },
                    child:Text('سيدنا سليمان عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Youns2');
                    },
                    child:Text('سيدنا يونس عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Essa');
                    },
                    child:Text('سيدنا عيسي عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Houd2');
                    },
                    child:Text('سيدنا هود عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Saleh');
                    },
                    child:Text('سيدنا صالح عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'Elyas');
                    },
                    child:Text('سيدنا إلياس  عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
                Container(
                    margin: EdgeInsets.only(top: 20,bottom: 20),
                    width: MediaQuery.of(context).size.width * 0.8,
                  height: 100,
                  child: RaisedButton(
                    onPressed: (){
                      Navigator.pushNamed(context, 'yahia');
                    },
                    child:Text('سيدنا يحيى  عليه السلام',style:TextStyle(fontSize: 22,fontWeight: prefix0.FontWeight.bold,) ,

                  ),
                    color: Colors.white,
                )
                ),
              ],
            )
          ],
        ),
      ),
    );}
}
class Adam extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة ادم عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('أبو البشر، خلقه الله بيده وأسجد له الملائكة وعلمه الأسماء وخلق له زوجته وأسكنهما الجنة وأنذرهما أن لا يقربا شجرة معينة ولكن الشيطان وسوس لهما فأكلا منها فأنزلهما الله إلى الأرض ومكن لهما سبل العيش بها وطالبهما بعبادة الله وحده وحض الناس على ذلك، وجعله خليفته في الأرض، وهو رسول الله إلى أبنائه وهو أول الأنبياء أخبر الله سبحانه وتعالى ملائكة بأنه سيخلق بشرا خليفة في الأرض - وخليفة هنا تعني على رأس ذرية يخلف بعضها بعضا. أخبرهم على سبيل التمويه، فقالت الملائكة سائلين استكشافا واستعلاما عن الحكمة من خلق آدم، لا اعتراضا على خلقه: (أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاء وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ) ويوحي قول الملائكة هذا بأنه كان لديهم تجارب سابقة في الأرض , أو إلهام وبصيرة , يكشف لهم عن شيء من فطرة هذا المخلوق , ما يجعلهم يتوقعون أنه سيفسد في الأرض , وأنه سيسفك الدماء . . ثم هم - بفطرة الملائكة البريئة التي لا تتصور إلا الخير المطلق - يرون التسبيح بحمد الله والتقديس له , هو وحده الغاية للوجود . . وهو متحقق بوجودهم هم , يسبحون بحمد الله ويقدسون له,ويعبدونه ولا يفترون عن عبادته ! هذه الحيرة والدهشة التي ثارت في نفوس الملائكة بعد معرفة خبر خلق آدم.. أمر جائز على الملائكة، ولا ينقص من أقدارهم شيئا، لأنهم، رغم قربهم من الله، وعبادتهم له، وتكريمه لهم، لا يزيدون على كونهم عبيدا لله، لا يشتركون معه في علمه، ولا يعرفون حكمته الخافية، ولا يعلمون الغيب . لقد خفيت عليهم حكمة الله تعالى , في بناء هذه الأرض وعمارتها , وفي تنمية الحياة , وفي تحقيق إرادة الخالق في تطويرها وترقيتها وتعديلها , على يد خليفة الله في أرضه . هذا الذي قد يفسد أحيانا , وقد يسفك الدماء أحيانا . عندئذ جاءهم القرار من العليم بكل شيء , والخبير بمصائر الأمور: (إِنِّي أَعْلَمُ مَا لاَ تَعْلَمُونَ) وما ندري نحن كيف قال الله أو كيف يقول للملائكة. وما ندري كذلك كيف يتلقى الملائكة عن الله ، فلا نعلم عنهم سوى ما بلغنا من صفاتهم في كتاب الله . ولا حاجة بنا إلى الخوض في شيء من هذا الذي لا طائل وراء الخوض فيه . إنما نمضي إلى مغزى القصة ودلالتها كما يقصها القرآن أدركت الملائكة أن الله سيجعل في الأرض خليفة.. وأصدر الله سبحانه وتعالى أمره إليهم تفصيلا، فقال إنه سيخلق بشرا من طين، فإذا سواه ونفخ فيه من روحه فيجب على الملائكة أن تسجد له، والمفهوم أن هذا سجود تكريم لا سجود عبادة، لأن سجود العبادة لا يكون إلا لله وحده. جمع الله سبحانه وتعالى قبضة من تراب الأرض، فيها الأبيض والأسود والأصفر والأحمر - ولهذا يجيء الناس ألوانا مختلفة - ومزج الله تعالى التراب بالماء فصار صلصالا من حمأ مسنون. تعفن الطين وانبعثت له رائحة.. وكان إبليس يمر عليه فيعجب أي شيء يصير هذا الطين؟ من هذا الصلصال خلق الله تعالى آدم .. سواه بيديه سبحانه ، ونفخ فيه من روحه سبحانه .. فتحرك جسد آدم ودبت فيه الحياة.. فتح آدم عينيه فرأى الملائكة كلهم ساجدين له .. ما عدا إبليس الذي كان يقف مع الملائكة، ولكنه لم يكن منهم، لم يسجد .. فهل كان إبليس من الملائكة ؟ الظاهر أنه لا . لأنه لو كان من الملائكة ما عصى . فالملائكة لا يعصون الله ما أمرهم ويفعلون ما يؤمرون . . وسيجيء أنه خلق من نار . والمأثور أن الملائكة خلق من نور . . ولكنه كان مع الملائكة وكان مأموراً بالسجود أما كيف كان السجود ؟ وأين ؟ ومتى ؟ كل ذلك في علم الغيب عند الله . ومعرفته لا تزيد في مغزى القصة شيئاً فوبّخ الله سبحانه وتعالى إبليس: (قَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ الْعَالِينَ) . وبدلا من التوبة والأوبة إلى الله تبارك وتعالى، ردّ إبليس بمنطق يملأه الكبر والحسد: (قَالَ أَنَا خَيْرٌ مِّنْهُ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ). هنا صدر الأمر الإلهي العالي بطرد هذا المخلوق المتمرد القبيح: (قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ) وإنزال اللعنة عليه إلى يوم الدين. ولا نعلم ما المقصود بقوله سبحانه (مِنْهَا) فهل هي الجنة ؟ أم هي السماء ؟ أم هي المنزلة والمكانة التي كان قد نالها بعبادته ؟ أم هي رحمة الله . . هذا وذلك جائز لكن الأرجح رحمة الله تعالى، أو المنزلة التي كان فيها فخسرها بسبب كبره ومخالفته لربه، فلم يكن إبليس في الجنة، وحتى آدم عليه السلام لم يكن في الجنة على الأرجح . ولا محل للجدل الكثير . فإنما هو الطرد واللعنة والغضب جزاء التمرد والتجرؤ على أمر الله الكريم قَالَ فَالْحَقُّ وَالْحَقَّ أَقُولُ (84) لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ هنا تحول الحسد إلى حقد . وإلى تصميم على الانتقام في نفس إبليس: (قَالَ رَبِّ فَأَنظِرْنِي إِلَى يَوْمِ يُبْعَثُونَ) . واقتضت مشيئة الله للحكمة المقدرة في علمه أن يجيبه إلى ما طلب , وأن يمنحه الفرصة التي أراد. فكشف الشيطان عن هدفه الذي ينفق فيه حقده: (قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ) ويستدرك فيقول: (إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ) فليس للشيطان أي سلطان على عباد الله المؤمنين وبهذا تحدد منهجه وتحدد طريقه . إنه يقسم بعزة الله ليغوين جميع الآدميين . لا يستثني إلا من ليس له عليهم سلطان . لا تطوعاً منه ولكن عجزاً عن بلوغ غايته فيهم ! وبهذا يكشف عن الحاجز بينه وبين الناجين من غوايته وكيده ; والعاصم الذي يحول بينهم وبينه . إنه عبادة الله التي تخلصهم لله . هذا هو طوق النجاة . وحبل الحياة ! . . وكان هذا وفق إرادة الله وتقديره في الردى والنجاة . فأعلن - سبحانه - إرادته . وحدد المنهج والطريق: (لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ) . فهي المعركة إذن بين الشيطان وأبناء آدم , يخوضونها على علم . والعاقبة مكشوفة لهم في وعد الله الصادق الواضح المبين . وعليهم تبعة ما يختارون لأنفسهم بعد هذا البيان . وقد شاءت رحمة الله ألا يدعهم جاهلين ولا غافلين . فأرسل إليهم المنذرين ثم يروي القرآن الكريم قصة السر الإلهي العظيم الذي أودعه الله هذا الكائن البشري , وهو يسلمه مقاليد الخلافة: (وَعَلَّمَ آدَمَ الأَسْمَاء كُلَّهَا) . سر القدرة على الرمز بالأسماء للمسميات . سر القدرة على تسمية الأشخاص والأشياء بأسماء يجعلها - وهي ألفاظ منطوقة - رموزا لتلك الأشخاص والأشياء المحسوسة . وهي قدرة ذات قيمة كبرى في حياة الإنسان على الأرض . ندرك قيمتها حين نتصور الصعوبة الكبرى , لو لم يوهب الإنسان القدرة على الرمز بالأسماء للمسميات , والمشقة في التفاهم والتعامل , حين يحتاج كل فرد لكي يتفاهم مع الآخرين على شيء أن يستحضر هذا الشيء بذاته أمامهم ليتفاهموا بشأنه . . الشأن شأن نخلة فلا سبيل إلى التفاهم عليه إلا باستحضار جسم النخلة ! الشأن شأن جبل . فلا سبيل إلى التفاهم عليه إلا بالذهاب إلى الجبل ! الشأن شأن فرد من الناس فلا سبيل إلى التفاهم عليه إلا بتحضير هذا الفرد من الناس . . . إنها مشقة هائلة لا تتصور معها حياة ! وإن الحياة ما كانت لتمضي في طريقها لو لم يودع الله هذا الكائن القدرة على الرمز بالأسماء للمسميات كان الله قد سمح لآدم وحواء بأن يقتربا من كل شيء وأن يستمتعا بكل شيء، ما عدا شجرة واحدة. فأطاع آدم وحواء أمر ربهما بالابتعاد عن الشجرة. غير أن آدم إنسان، والإنسان ينسى، وقلبه يتقلب، وعزمه ضعيف. واستغل إبليس إنسانية آدم وجمع كل حقده في صدره، واستغل تكوين آدم النفسي.. وراح يثير في نفسه ويوسوس إليه: (هَلْ أَدُلُّكَ عَلَى شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَّا يَبْلَى) وأقسم إبليس لآدم أنه صادق في نصحه لهم، ولم يكن آدم عليه السلام بفطرته السليمة يظن أن هنالك من يقسم بالله كذبا، فضعف عزمه ونسي وأكل من الشجرة هو وحواء. تذكر الإسرائليات أن حواء أكلت من الشجرة قبل آدم، وأنها هي التي شجعته على الأكل منها. ويستدل البعض بحديث أبي هريرة -رضي الله عنه- عن النبي -صلى الله عليه وسلم-: (لولا بنو إسرائيل لم يخنز اللحم، ولولا حواء لم تخن أنثى زوجها). إلا أن هذا الحديث لا يذكر صراحة بأن حواء هي من حث آدم على الأكل من الشجرة. بل إن نص القرآن لا يذكر حواء وحدها وإنما تحدثت الآيات عن الحادثة بصيغة الجمع (ذَاقَا) (فَأَكَلا) بل إن النص القرآني يذكر آدم -كمسئول عما حدث- عليه الصلاة والسلام (وَعَصَى آدَمُ رَبَّهُ فَغَوَى) وهكذا أخطأ الشيطان وأخطأ آدم. أخطأ الشيطان بسبب الكبرياء، وأخطأ آدم بسبب الفضول. لم يكد آدم ينتهي من الأكل حتى اكتشف أنه أصبح عار، وأن زوجته عارية. وبدأ هو وزوجته يقطعان أوراق الشجر لكي يغطي بهما كل واحد منهما جسده العاري. ولم تكن لآدم تجارب سابقة في العصيان، فلم يعرف كيف يتوب، فألهمه الله سبحانه وتعالى عبارات التوبة (قَالاَ رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ) (23) (الأعرف) وأصدر الله تبارك وتعالى أمره بالهبوط من الجنة وهبط آدم وحواء إلى الأرض. واستغفرا ربهما وتابا إليه. فأدركته رحمة ربه التي تدرك الإنسان عندما يثوب إليها ويلوذ بها ... وأخبرهما الله أن الأرض هي مكانهما الأصلي.. يعيشان فيهما، ويموتان عليها، ويخرجان منها يوم البعث. يتصور بعض الناس أن خطيئة آدم بعصيانه هي التي أخرجتنا من الجنة. ولولا هذه الخطيئة لكنا اليوم هناك. وهذا التصور غير منطقي لأن الله تعالى حين شاء أن يخلق آدم قال للملائكة: "إِنِّي جَاعِلٌ فِي الأَرْضِ خَلِيفَةً" ولم يقل لهما إني جاعل في الجنة خليفة. وقد ورد في صحيحي بخاري ومسلم عن أبي هريرة -رضي الله عنه- عن النبي -صلى الله عليه وسلم- قال (حاج موسى آدم عليهما السلام، فقال له: أنت الذي أخرجت الناس بذنبك من الجنة وأشقيتهم. قال آدم: يا موسى، أنت الذي اصطفاك الله برسالاته وبكلامه، أتلومني على أمر قد كتبه الله علي قبل أن يخلقني، أو قدَّره علي قبل أن يخلقني؟). قال رسول الله -صلى الله عليه وسلم-: (فحجَّ آدمُ موسى) لم يكن هبوط آدم إلى الأرض هبوط إهانة، وإنما كان هبوط كرامة كما يقول العارفون بالله. كان الله تعالى يعلم أن آدم وحواء سيأكلان من الشجرة. ويهبطان إلى الأرض. أما تجربة السكن في الجنة فكانت ركنا من أركان الخلافة في الأرض. ليعلم آدم وحواء ويعلم جنسهما من بعدهما أن الشيطان طرد الأبوين من الجنة، وأن الطريق إلى الجنة لا يذكر لنا المولى عزّ وجلّ في كتابه الكريم الكثير عن حياة آدم عليه السلام في الأرض. لكن القرآن الكريم يروي قصة ابنين من أبناء آدم هما هابيل وقابيل. حين وقعت أول جريمة قتل في الأرض كانت حواء تلد في البطن الواحد ابنا وبنتا. وفي البطن التالي ابنا وبنتا. فيحل زواج ابن البطن الأول من البطن الثاني.. فأراد هابيل أن يتزوج أخت قابيل، إلا أن قابيل آراد أخته لنفسه لأنها كانت أجمل من أخت هابيل.  فأمرهما آدم أن يقدما قربانا، فقدم كل واحد منهما قربانا. كان هابيل صاحب غنم فقرب واحدة سمينة، بينما كان قابيل صاحب زرع فقدم حزمة من رديء زرعه. فتقبل الله من هابيل ولم يتقبل من قابيل. فغضب قابيل وهدد أخاه بأن يقتله. فأجاب هابيل بأن الله يتقبل من المتقين. وبكل حلم قال هابيل (لَئِن بَسَطتَ إِلَيَّ يَدَكَ لِتَقْتُلَنِي مَا أَنَاْ بِبَاسِطٍ يَدِيَ إِلَيْكَ لَأَقْتُلَكَ إِنِّي أَخَافُ اللّهَ رَبَّ الْعَالَمِينَ (28) إِنِّي أُرِيدُ أَن تَبُوءَ بِإِثْمِي وَإِثْمِكَ فَتَكُونَ مِنْ أَصْحَابِ النَّارِ وَذَلِكَ جَزَاء الظَّالِمِينَ (29)) (المائدة) انتهى الحوار بينهما وانصرف الشرير وترك الطيب مؤقتا. بعد أيام.. كان الأخ الطيب نائما فقام إليه أخوه قابيل فقتله بصخرة رماها على رأسه. وقيل بأن هابيل أبطأ في الرعي ذات ليلة، فذهب إليه قابيل وضربه بحديدة كانت معه. وقيل أنه خنقه خنقا شديدا وعضه كما تفعل السباع. قال رسول الله صلى الله عليه وسلم: ";لا تقتل نفس ظلما إلا كان على ابن آدم الأول كفل من دمها لأنه كان أول من سن القتل" جلس القاتل أمام شقيقه الملقى على الأرض. كان هذا الأخ القتيل أول إنسان يموت على الأرض.. ولم يكن دفن الموتى شيئا قد عرف بعد. وحمل الأخ جثة شقيقه وراح يمشي بها.. ثم رأى القاتل غرابا حيا بجانب جثة غراب ميت. وضع الغراب الحي الغراب الميت على الأرض وساوى أجنحته إلى جواره وبدأ يحفر الأرض بمنقاره ووضعه برفق في القبر وعاد يهيل عليه التراب.. بعدها طار في الجو وهو يصرخ. فحزن قابيل أنه عجز حتى عن معرفه ما يفعل بجثمان أخيه، فكان هذا الغراب أفضل منه. وكبر آدم. ومرت سنوات وسنوات.. وعن فراش موته، يروي أبي بن كعب، فقال: إن آدم لما حضره الموت قال لبنيه: أي بني، إني أشتهي من ثمار الجنة. قال: فذهبوا يطلبون له، فاستقبلتهم الملائكة ومعهم أكفانه وحنوطه، ومعهم الفؤوس والمساحي والمكاتل، فقالوا لهم: يا بني آدم ما تريدون وما تطلبون؟ أو ما تريدون وأين تطلبون؟ قالوا: أبونا مريض واشتهى من ثمار الجنة، فقالوا لهم: ارجعوا فقد قضي أبوكم. فجاءوا فلما رأتهم حواء عرفتهم فلاذت بآدم، فقال: إليك عني فإني إنما أتيت من قبلك، فخلي بيني وبين ملائكة ربي عز وجل. فقبضوه وغسلوه وكفنوه وحنطوه، وحفروا له ولحدوه وصلوا عليه ثم أدخلوه قبره فوضعوه في قبره، ثم حثوا عليه، ثم قالوا: يا بني آدم هذه سنتكم.وفي موته يروي الترمذي: حدثنا عبد بن حميد، حدثنا أبو نعيم، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم : "لما خلق الله آدم مسح ظهره، فسقط من ظهره كل نسمة هو خالقها من ذريته إلى يوم القيامة، وجعل بين عيني كل إنسان منهم وبيصاً من نور، ثم عرضهم على آدم فقال: أي رب من هؤلاء؟ قال: هؤلاء ذريتك، فرأى رجلاً فأعجبه وبيص ما بين عينيه، فقال: أي رب من هذا؟ قال هذا رجل من آخر الأمم من ذريتك يقال له داود، قال: رب وكم جعلت عمره؟ قال ستين سنة، قال: أي رب زده من عمري أربعين سنة. فلما انقضى عمر آدم جاءه ملك الموت، قال: أو لم يبق من عمري أربعون سنة؟ قال: أو لم تعطها ابنك داود؟ قال فجحد فجحدت ذريته، ونسي آدم فنسيت ذريته، وخطىء آدم فخطئت ذريته"',
                style:TextStyle(fontSize: 22),textDirection: prefix0.TextDirection.rtl,),
            )],)),);



  }
}
class Nouh extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة نوح عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child:  Text('ولقد أرسلنا نوحا إلى قومه فلبث فيهم ألف سنة إلا خمسين عاما فأخذهم الطوفان وهم ظالمون مرت أعوام على موت سيدنا آدم عليه السلام وتغيرت فى الأرض أشياء كثيرة ، عاد العصيان إلى الظهور مرة ثانية ، وكان البشر فى حاجة إلى رسول يعيدهم إلى سواء السبيل وقد ولد سيدنا نوح عليه السلام بعد وفاه آدم بمائة وست وعشرين سنة - فيما ذكره ابن جرير - وعاش سيدنا نوح ألف سنة إلا خمسين عاما وقيل إن هذه السنين هى مدة رسالته كان سيدنا نوح إذا استيقظ أو نام أو شرب أو أكل أو لبس ملابسه أو خرج أو دخل يشكر الله ويحمده ويذكر نعمته عليه ولهذا قال الله تعالى عن نوح } إنه كان عبداً شكوراُ" اختار الله عبده الشاكر وأرسله نبيا إلى قومه. خرج نوح عليه السلام على قومه وبدأ دعوته } يا قوم اعبدوا الله ما لكم من إله غيره إني أخاف عليكم عذاب يوم عظيم ظل سيدنا نوح يدعو قومه إلى عبادة الله ، لم يلق نبي من الأذى مثلما لقى سيدنا نوح عليه السلام من طول مدة إقامته وهو يدعو قومه إلى الإيمان بالله سبحانه وتعالى ، وكان قومه أشد عليه من الأمم السابقة واللاحقة كانوا أظلم الناس وأكثرهم تمردا وكفرا وعصيانا ، كذبه قومه وقالوا إنه مجنون ويقول ما لا يعقل ولا يؤمن به عاقل. وانهالوا عليه بالسب واللعن والتخويف وتشديد الوعيد. فقال نوح عليه السلام يارب إنى ضعيف لا أستطيع مقاومة هؤلاء فانتقم منهم وانتصر لدينك} كذبت قبلهم قوم نوح فكذبوا عبدنا وقالوا مجنون وازدجر فدعا ربه أنى مغلوب فانتصر" ولكنه لم يجبرهم على الإيمان برسالته وهم كارهون ، ولما يئس نوح عليه السلام من صلاحهم وفلاحهم ورأى أنهم لا خير فيهم وتوصلوا إلى أذيته ومخالفته وتكذيبه بكل طريق من أفعال و أقوال. دعا عليهم دعوة غضب فلبى الله دعوته وأجاب طلبه } ونوحاً إذ نادى من قبل فاستجبنا له فنجيناه وأهله من الكرب العظيم مرت الأعوام ونوح يدعو قومه وكلما دعاهم إلى الله فروا منه ، وكلما دعاهم ليغفر الله لهم جعلوا أصابعهم فى آذانهم واستكبروا عن سماع الحق } فلم يزدهم دعائي إلا فرارا" ، حزن نوح على قومه حزناً شديداً. وجاء يوم أوحى الله إليه "أنه لن يؤمن من قومك إلا من قد آمن" ، وأوحى الله إليه ألا يحزن عليهم وأمره أن يصنع فلكاً } قال رب انصرني بما كذبون فأوحينا إليه أن أصنع الفلك بأعيننا ووحينا" أخبره الله تعالى أنه سيصنع هذه السفينة بعلم الله وتعليمه وعلى مرأى منه وطبقاً لتوجيهاته ومساعدة الملائكة ، وبدأ نوح يغرس الشجر ويزرعه ليصنع منه السفينة ، انتظر لسنوات ثم قطع ما زرعه وبدأ نجارته ، بدأ سيدنا نوح يبنى السفينة ، ويمر عليه الكفار فيرونه منهمكا فى صنع السفينة فيسخرون منه لعدم وجود أنهار قريبة أو بحار} ويصنع الفلك وكلما مر عليه ملأ من قومه سخروا منه قال إن تسخروا منا فإنا نسخر منكم كما تسخرون" انتهى سيدنا نوح من صنع السفينة وجلس ينتظر أمر الله. أوحى الله إليه أنه إذا فار التنور كان هذا علامة على بدء الطوفان وأمره الله أن يحمل فى السفينة من كل حيوان وطير ووحش زوجين اثنين ، وبدأ الصعود إلى السفينة وصعد من آمن بنوح وكان عدد المؤمنين قليلا} حتى إذا جاء أمرنا وفار التنور قلنا احمل فيها من كل زوجين اثنين وأهلك إلا من سبق عليه القول ومن آمن وما آمن معه إلا قليل" لم تكن زوجة نوح مؤمنة به فلم تصعد وكانت أغلبية الناس غير مؤمنة هى الأخرى فلم تصعد. ارتفعت المياه من فتحات الأرض ولم تبق هناك فتحة فى الأرض إلا وخرج منها الماء ، وانهمرت من السماء أمطار غزيرة بكميات لم تر مثلها الأرض من قبل ، ارتفعت المياه أعلى من الناس تجاوزت قمم الأشجار وقمم الجبال وغطت سطح الأرض كله} ففتحنا أبواب السماء بماء منهمرہ وفجرنا الأرض عيونا فالتقى الماء على أمر قد قدرہ وحملناه على ذات ألواح ودسر وفى بداية الطوفان نادى نوح ابنه قبل سير السفينة وقال له اركب معنا ولا تهلك نفسك بالغرق فتغرق مع الكافرين } يا بنى اركب معنا ولا تكن مع الكافرين" قال الابن سوف أصعد إلى رأس الجبل أتحصن به ، ظنا منه أن الماء لن تصل إلى قمم الجبال } قال سآوى إلى جبل يعصمني من الماء" وعاد نوح يقول له } قال لا عاصم اليوم من أمر الله إلا من رحم وحال بينهما الموج فكان من المغرقين."شاءت رحمة الله أن يغرق الابن بعيدا عن عين الأب ، رحمة منه بالأب كي لا يشاهد مصرعه واستمر الطوفان وكانت كل عين تطرف على الأرض قد هلكت غرقاً ، لم يعد باقيا من الحياة والأحياء غير السفينة التى تحمل المؤمنين ، واستمر الطوفان زمناُ لا نعرف مقداره ، ثم أمر الله سبحانه وتعالى السماء أن تمسك عن المطر وإلى الأرض أن تستقر وتبتلع الماء ، وأمر السفينة أن ترسو على الجودي ويقال إنه جبل فى العراق } وقيل يا أرض ابلعي ماءك ويا سماء أقلعي وغيض الماء وقضى الأمر واستوت على الجودي وقيل بعداً للقوم الظالمين بعد ذلك أمر الله نوحا عليه السلام أن يهبط من السفينة محاطا ببركة الله ورعايته } قيل يا نوح اهبط بسلام منا وبركات عليك وعلى أمم ممن معك.',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Ibrahem2 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة ابراهيم عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child:  Text('وإبراهيم -عليه السلام- هو أبو الأنبياء، فولده إسحاق من نسله كل أنبياء بني إسرائيل الذين خُتِموا بعيسى ابن مريم -عليهم السلام أجمعين- وابنه إسماعيل من نسله خاتم الأنبياء والمرسلين محمد -صلى الله عليه وسلم- قال الله: (وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ كُلًّا هَدَيْنَا وَنُوحًا هَدَيْنَا مِنْ قَبْلُ وَمِنْ ذُرِّيَّتِهِ دَاوُودَ وَسُلَيْمَانَ وَأَيُّوبَ وَيُوسُفَ وَمُوسَى وَهَارُونَ وَكَذَلِكَ نَجْزِي الْمُحْسِنِينَ وَزَكَرِيَّا وَيَحْيَى وَعِيسَى وَإِلْيَاسَ كُلٌّ مِنَ الصَّالِحِينَ وَإِسْمَاعِيلَ وَالْيَسَعَ وَيُونُسَ وَلُوطًا وَكُلًّا فَضَّلْنَا عَلَى الْعَالَمِينَ نشأ إبراهيم -عليه السلام- بأرض بابل وهي أرض الكلدانيين وهي بالعراق وكان قومه يعبدون الأصنام التي لا تسمع عابدها ولا تبصر مكانه تزوج نبي الله إبراهيم بسارة وكانت عاقرا لا تلد، وقد أنار الله بصيرة إبراهيم -عليه السلام- فعلمه أن هذه أصنام لا تسمع ولا تبصر ولا تنفع ولا تضر، فآتاه الله رشده في صغره وابتعثه رسولا واتخذه خليلا في كبره، قال الله تعالى: (وَلَقَدْ آتَيْنَا إِبْرَاهِيمَ رُشْدَهُ مِنْ قَبْلُ وَكُنَّا بِهِ عَالِمِينَ إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَا هَذِهِ التَّمَاثِيلُ الَّتِي أَنْتُمْ لَهَا عَاكِفُونَ) فبدأ يدعوا كل من حوله إلى الإيمان بالله وترك عبادة الأصنام، فدعا أباه وتلطف في دعوته ليترك ما هو عليه، وكان والد إبراهيم -عليه السلام- ممن يعبدون الأصنام وكان يعمل نجارا ينحت الأصنام ويبيعها لمن يعبدها، فدعا إبراهيم والده بألطف عبارة وأحسن إشارة فبين له بطلان ما هو عليه من عبادة الأوثان التي لا تسمع دعاء عابدها ولا ترى مكانه، فكيف تغني عنه شيئا أو تفعل له خيرا، ولكن أباه لم يقبل نصيحته وتهدده وتوعده وطلب منه أن يفارقه بالهجران وذلك بعد أن عجز على أن يرد على حجته قال الله تعالى: (وَاذْكُرْ فِي الْكِتَابِ إِبْرَاهِيمَ إِنَّهُ كَانَ صِدِّيقًا نَبِيًّا إِذْ قَالَ لِأَبِيهِ يَاأَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِي عَنْكَ شَيْئًا يَا أَبَتِ إِنِّي قَدْ جَاءَنِي مِنَ الْعِلْمِ مَا لَمْ يَأْتِكَ فَاتَّبِعْنِي أَهْدِكَ صِرَاطًا سَوِيًّا يَا أَبَتِ لَا تَعْبُدِ الشَّيْطَانَ إِنَّ الشَّيْطَانَ كَانَ لِلرَّحْمَنِ عَصِيًّا يَا أَبَتِ إِنِّي أَخَافُ أَنْ يَمَسَّكَ عَذَابٌ مِنَ الرَّحْمَنِ فَتَكُونَ لِلشَّيْطَانِ وَلِيًّا قَالَ أَرَاغِبٌ أَنْتَ عَنْ آلِهَتِي يَاإِبْرَاهِيمُ لَئِنْ لَمْ تَنْتَهِ لَأَرْجُمَنَّكَ وَاهْجُرْنِي مَلِيًّا) لما أغلظ والد إبراهيم القول له أحسن إبراهيم في الرد عليه ووعده بأن يستغفر له، قال الله: (قَالَ سَلَامٌ عَلَيْكَ سَأَسْتَغْفِرُ لَكَ رَبِّي إِنَّهُ كَانَ بِي حَفِيًّا) لكن لما تبين له أنه عدو لله تبرأ منه، قال الله: (وَمَا كَانَ اسْتِغْفَارُ إِبْرَاهِيمَ لِأَبِيهِ إِلَّا عَنْ مَوْعِدَةٍ وَعَدَهَا إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ إِنَّ إِبْرَاهِيمَ لَأَوَّاهٌ حَلِيمٌ). وقال النبي -صلى الله عليه وسلم-: (يلقى إبراهيم أباه آزر يوم القيامة وعلى وجه آزر قترة وغبرة فيقول له إبراهيم: ألم أقل لك لا تعصني، فيقول أبوه: فاليوم لا أعصيك، فيقول إبراهيم: يا رب إنك وعدتني أن لا تخزيني يوم يبعثون فأي خزي أخزى من أبي الأبعد؟ فيقول الله تعالى: إني حرمت الجنة على الكافرين، ثم يقال: يا إبراهيم ما تحت رجليك؟ فينظر فإذا هو بذيخ [هو ذكر الضبع الكثير الشعر أي أراه الله أباه على غير هيئته ليسرع إلى التبرؤ منه] متلطخ [متلوث بالدم] فيؤخذ بقوائمه فيلقى في النار)[البخاري]',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Ismaeel extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة اسماعيل عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child:  Text('تزوج سيدنا ابراهيم عليه السلام من السيدة سارة ، فكانت امراة مؤمنه بالله تعين زوجها على الحق ، والخير وطاعة الله ولكن السيدة سارة لم تكن تنجب ، فحزنت كثيرا لذلك ، وتمنت ان يرزقها الله الولد الصالح من اجل زوجها ، ونظرت الى ابراهيم لا ولد له ، فلما هاجرت الى مصر ووهبها ملكها جاريةاسمها هاجر ، فنظرت اليها ورأت من هاجر جميل صفاتها وخلقها ، فوهبتها لسيدنا ابراهيم عليه السلام فتزوجها ولما تزوج ابراهيم عليه السلام من السيدة هاجر المصرية بعد السيدة سارة ، وانتظر ابراهيم رحمة الله وكان دائم الدعوة ان يرزقه الله الولد فرزقه اسماعيل على كبر ، فاخذ ابراهيم ولده اسماعيل وامه هاجر بعد فترة ، واسكنهم بواد لا زرع فيه عند بيت الله الحرام بمكة المكرمة ، فتركهما هناك ورحل بعد ان استودعهما الله تعالى ان يحفظهما من كل شر وسوء ، وكان ذلك بامر من الله عز وجل ، وشب اسماعيل وبلغ مبلغ الشباب القادرين على تحمل المسؤلية والعمل ، وفي يوم  من الايام راى سيدنا ابراهيم في المنام ، بانه يذبح ولده اسماعيل ، فقام من نومه متعجبا مما راى ، انه ولده الوحيد ، الذي رزقه الله اياه على كبر ، ولكن رؤيا تكررت كثيرا ، ورؤيا الانبياء امر من الله ، فعلم بان ذلك امر من الله تعالى وكان لابد من تنفيذ امر الله ، فذهب ابراهيم الى ابنه اسماعيل وتلطف معه بالكلام ، وقال له يا بني لقد رايت في المنام اني اذبحك ، وهذة رؤيا من الله ، فماذا تقول يا ولدي ؟ فرد اسماعيل بسرعة : يا ابت العزيز افعل ما امرك الله تعالى به ، ستجدني ان شاء الله من الصابرين ، فاحتضن ابراهيم عليه السلام ولده واستسلم لامر الله تعالي ، وعرفت الام ان زوجها سيذبح ولده ، وقد رضيت هي الاخرى بقضاء الله وقدره فجاء الشيطان الى ابراهيم عليه السلام ، وقال له : اتذبح ولدك الوحيد الذي انتظرته بعد طول العمر يا ابراهيم ، فرماه ابراهيم بالاحجار ، ثم ذهب الى هاجر وقال لها ، اتتركين ولدك يذبح بارض ليس لك فيها احد ، فرمته بالاحجار ، وهذا ما يعرف في الحج برمي الجمرات  اخذ ابراهيم عليه السلام ، ولده اسماعيل الى مكان بعيد في مكه ومعه ، السكين وارقد اسماعيل على ظهره ، فقال اسماعيل : يا ابت اجعلني على وجهي حتى اذا امسكت بالسكين لا ترى وجهي ، فتتحرك فيك مشاعر الابوة فتعصى الله تعالى فيما امرك به ، وارقد ابراهيم ولده اسماعيل وامسك بالسكين ليذبحه ، ولما هم بذبح ولده ، ضجت الملائكة في السماء واخذت تدعوا الله تعالى ان يرف الاختبار عن ابراهيم وولده اسماعيل ، فاستجاب الله تعالى لدعاء المائكة ، وامر جبريل عليه السلام ان ينل بكبش من الجنة ، وان يذبحة ونزل جبريل بكبش من السماء املح ذو  قرون على ابراهيم ، وامره بذبح الكبش بدلا من اسماعيل فداء له ، بعد ان نجح هو وولده في اختبار الله تعالى وصبروا والله لا يضيع أجر الصالحين ابدا .',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Mousa extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة موسي عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('كان هناك ملك طاغية يدعي فرعون وقد رأي في ليلة من الليالي أن ناراً تأكل ملكه وتقتل شعبه وهي آتية من ناحية بيوت بني إسرائيل، قام فرعون مفزوعاً خائفاً من نومه، فأسرع بإستدعاء السحرة والكهنه وحكي لهم ما رأي، فأخبروه أن تفسير هذة الرؤيا أنه سيولد في بني إسرائيل غلام يكون سبباً في ذهاب ملكه وهلاكه علي يديه، فإشتد فزع فرعون وأمر جنوده وحاشيته أن يقتلوا كل مولود ذكر يولد من بني إسرائيل وكانت امرأة عمران حاملاً بنبي الله موسي عليه السلام، فعندما علمت بأمر فرعون أخفت حملها وخافت عليه، فكانت لا تظهر لأحد أبداً انها حاملاً حتي أتمت حملها وجاء وقت الوضع، فأنجب النبي موسي عليه السلام سراً، وحفظة الله عز وجل فلم يعلم جنود فرعون بأمر موسى، وقذف الله في قلب أم موسى أنها إن خافت عليه تضعه في صندوق وتربطه ببيتها وتلقيه في النهر لكي لا يراه أحد من جنود فرعون الظالم، وترضعه كل فترة وفي يوم خرجت أم موسي لتضرع إبنها، فإذا بها تجد أن الحبل قد قطع وأن الصندوق قد جري في النهر حتي رآه جنود فرعون فأخذوه إليه، فعندما رأته امرأة فرعون طلبت منه أن تأخذه ولداً لها، ولكن موسي عليه السلام رفض أن يرضع من جميع المرضعات، حتي علمت أخت موسى بأمره، فقالت لامرأة فرعون أن تعلم من يرضع هذا الطفل، وطلبت من أم موسى أن تأخذ الطفل لترضعه فوافقت امرأة فرعون، وعاد موسي لأمه آمناً كبر موسى وكان شاباً قوياً، كان عادلاً لا يحب الظلم أبداً، وفي يوم وجد رجلان يتعاركان أحدهما من بني إسرائيل والآخر من جنود فرعون، فدفع سيدنا موسى الجندي فوقع ميتاً دون قصد من النبي موسى، فذهب خبر مقتل الجندي إلي فرعون، فقرر أن يقتل موسي جزاء فعله .. وكان يوجد رجل من ملأ فرعون عرف ما حدث فأسرع يخبر موسى عن نية فرعون لقتلة، فقال يا موسى أخرج من مصر، فقرر موسى عليه السلام الهروب من مصر حتي وصل إلي مدينة مدين في فلسطين وعندما دخل سيدنا موسى مدين وجد أناساً يسقون الأبل والاغنام وقد لاحظ فتاتيت ضعيفتان لم يقمن بالسقي خوفاً من الإختلاط بالرجال، فأخذ موسى أغنامهما وسقي لهما، فعادت الفتاتان إلي أبنهما وقصتا عليه ما حدث، فطلب أبوهما من موسي أن يعمل أخيراً عنده مقابل أن يتزوج إحدي ابنتيه، فوافق سيدنا موسى وعاش في مدين عشر سنين، وبعد ذلك قرر العودة إلي مصر، فلما وصل إلي جبل الطور، ناداه الله عز وجل واصطفاه نبياً لبني إسرائيل عاد النبي موسى يدعو فرعون وقومة إلي توحيد الله وعبادته، إلا أن فرعون تكبر ورفض دعوته واتهمه بالسحر، وجمع له السحرة ليبينوا للناس أن موسى ساحر كذاب، ولكن الله عز وجل نصر عبده فرمي سيدنا موسي العصا فالتقمت كل عصيان السحرة، فآمن السحرة بالله فعذبهم فرعون حتي الموت وأمر الله موسى أن يخرج من مصر مع بني إسرائيل، فلما اقترب من البحر خاف بنو إسرائيل أن يلحق بهم فرعون وجنوده، أو أن يغرقوا، فأمر الله عز وجل موسى أن يضرب البحر بعصاه، فشق البحر إلي ممرات عبر فيها بنو إسرائيل مع موسي، وأغرق الله فرعون وجنوده بظلمهم ونجى موسى ومن معه .',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Yousof extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة يوسف عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('عرف عن يوسف عليه السلام الصبر حيث أنه من ضمن اكثر الرسل الذين مروا بمحن شديدة خلال حياتهم وخلال الدعوة، وبالنظر إلى قصة يوسف يمكننا التأكد من هذا فبداية محنة يوسف عليه السلام كانت وهو صبي صغير حيث حاز على حب ابيه وتفضيله له عن باقي اخوته، مما دفع قلوبهم إلى الحقد عليه فقاموا بتنفيذ خطة محكمة للتخلص منه حيث اقنعوا ابيهم أن يأخذوه للرعي معهم وبعدها قاموا بنزع قميصه وتلطيخه بالدماء وإلقائه بالبئر واخذ القميص لأبيهم حتى يقتنع بموته كانت تلك اولى المحن وبعدها كانت المحنة الثانية حيث وجده بعض المسافرين وأخذوه كبضاعة وقدموه إلى العزيز الذي تولاه وزوجته بالتربية إلى أن بلغ مبلغ الشباب، فكان شديد الجمال والفتنة حتى أن من ربته فتنت به وحاولت مراودته عن  ولكنه امتنع واستعصم بالله حتى ينقذه مما وضع فيه من فتنة فكانت بذلك محنة جديد تضاف إلى محن يوسف عليه السلام. ثم كانت المحنة التالية وهى اتهام يوسف بمحاولته التعدي على زوجة العزيز وتفضيله السجن على أن يرضخ لمطلبها، فأودع السجن لسنوات وهناك كان لقائه باثنين من السجناء حيث تعرفوا على مهارته في تفسير الرؤى حيث فسر لهم رؤياهم وقد طلب من الذي اعتقد انه يخرج ويكون من سقاة الملك أن يذكره عند الحاكم كل ما مر به يوسف من محن لم يتخلى عن ايمانه وثقته بالله وكان دائم اللجوء إليه وكان له العاقبة الحسنة حيث اصبح يوسف عليه السلام عزيز مصر ومالك خزائنها واتى بابيه وإخوته وقومه لأرض مصر بعد المحنة القوية التي مرت بهم من مجاعة وقحط. ',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Yaqob extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة يعقوب عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('كان لنبي الله سليمان عليه السلام ، جنوده من الجن والإنس والطير ، وكان أعجب جيش عرفه التاريخ ، فكان الجيش يتكون من جنود البشر ومن جنود الوحش والطير ، وكانت الرياح مسخرة لهذا الجيش ، تستطيع حمله حيث يريد ، وكان القسم من البشر فيه الكثير من المقاتلين المشاة والفرسان ، وقسم الجن فهو يضم الجن المقاتلين الذين لا يظهرون ، والجن اصلا كائنات مستترة لا تظهر ، وكان الجيش قوى فالعدو لا يراه ولا عرف من اين تجيئه ضربته فيستعد لها ، واليوم اقدم لكم في موقع قصص واقعية قصة سيدنا سليمان والملكة والهدهد قصص دينية للأطفال من القرآن الكريم  كان جيش سيدنا سليمان جيش قوى جدا لا يقهر ، كان يضم جزء من الوحوش والطيور والحيوانات والجن والانس ، كانت الأسود تتصدر جيش الوحوش ، ومن بعدها جاءت النمور، أما الطير فكان عددها هائل من النسور والصقور ، وكان الهدهد الجميل هو المسؤل عن الاستخبارات في الجيش، ومهمته أن يطير إلى أبعد المسافات ويكون عينا للجيش ، يرى عن العدو كل شيء ويعرف عنه كل شيء ، ثم يعود ليقدم تقريره إلى قائده الأعلى مباشرة ، لم يمض وقت طويل حتى بدأ سليمان عليه السلام ، يمر على الجيش ، لم يستغرف سليمان طويلا ليكتشف غياب الهدهد ، في نفس الوقت كان الهدهد الغائب يقف في مملكة سبأ ، لقد طار طويلا حتى وصل إلى سبأ ، لاحظ الهدهد وجود حركة غير عادية في المدينة ، حتى خيل إليه أن الناس ذاهبون جميعا إلى احتفال ما ، سأل طيرا من بني جنسه ، ماذا يجري هنا  ،  قال الطير ، هذا احتفالهم اليومي بالسجود للشمس ، احس هدهد سليمان أنه وقع على قضية خطيرة جدا ، سأل طيرا من بني جنسه ، ماذا يجري هنا ، قال الطير هذا احتفالهم اليومي بالسجود للشمس ، لاحظ هدهد سليمان  هذا كله جرى ذهنه إلى الملك سليمان ، كيف يقع عليه هذا النبأ الذي عرفه في سبأ ، طار الهدهد وحلق بعيدا في السماء ، واخذ يطير إلى خيمه الطيور في جيش سليمان . لم يكد يدخل خيمة الطيور حتى اسرعت نحوه الطيور منزعجة ، حدثته أن الملك سليمان اكتشف غيابه وقال ، ” مالي لا أرى لهدهد أم كان من الغائبين ، لأعذبنه عذابا شديد ، أو لأذبحنه ، أو ليأتني بسطان مبين ” ، بدأ الانزعاج على الهدهد وقرر بقلق أن يرى قائده الأعلى على الفور ، قدر الهدهد في نفسه أن سليمان غاضب عليه ، وربما تزايد غضبه لو زاد تأخيره في لقائه ، ولهذا قرر أن يلتقي بسليمان على الفور ، ولاحظ الوحوش والطي أن الهدهد فكر طويلا وهو مطرق الرأس ، ثم ما لث أن خرج من الخيمة طائر واتجه نحو قصر سليمان ، وكان سليمان يجلس على مائدة العشاء ، دخل الهدهد القاعة من النافذة ووقف على طرف المائدة المقابل ، كان بعيدا عن قبضته ، نكس الهدهدرأسه وحيا سليمان ثم رفع رأسه تواضعا ، ولكنه لم يتجاوز بنظراته أيدي سليمان وصدره ، لم يرفع الهدهد رأسه احتراما ليرى وجه سليمان ، وظل طوال الحديث مع سليمان وهو يركز على يدى النبي ، قرر الهدهد أن يكون يكون هو البادىء بالحوار ، كان يعرف عن قائدة الأعلى كثيرا من الحقائق ، ويدرك أن أقصر الطرق إلى قلبه هو الخط المستقيم ، لم يكد الهدهد يرفع رأسه بعد تحيته لسليمان حتى قال  ” احطت بما لم تحط به ، وجئتك ن سبأ بنبأ يقين ” ، نظر الهدهد في يدى سليمان فوجدهما تنقران على المائدة ، هذا يعنى أن سليمان يفكر ، ألقى الهدهد بالخبر على المائدة . قال الهدهد ” اني وجدت امرأة تملكهم وأوتيت من كل شيء ولها عرش عظيم ” ، و :” وجدتها وقومها يسجدون للشمس من دون الله ، وزين لهم الشيطان أعمالهم فصدهم عن السبيل فهم لا يهتدون ” كان الخبر مثيرا ، هذا يعني أن الهدهد كان في مهمة ولم يكن يعبث ، اكمل الهدهد يقول محاولا كسب قلب النبي سليمان عليه السلام ، ” الا يسجودا لله الذي يخرج الخبء في السموات والأرض ، ويعلم ما تخفون وما تعلنون ، الله لا اله ألا هو رب العرش العظيم ” ، كانت هذه الكلمات أصلا كلمات سليمان ، وكان يقولها للناس وهو يدعوهم إلى الله ، ابتسم سليمان ولكن الهدهد لم يرفع وجهه ليرى ابتسامة قائده الأعلى ، قال سليمان : سننظر أصدقت أم كنت من الكاذبين ، اذهب بكتابي هذا فالقه اليهم ثم تول عنهم ، فانظر ماذا يرجعون ” حمل الهدهد خطاب سليمان وهو مغلق ومختوم ، وطار به حتى وصل الى سبأ ، اختبأ جدا في الاشجار ، وتلفت حوله فرأى الجو امنا ، فعاد يطير نحو قصر الملكة اطل الهدهد بحذر فرأى المكلة نائمة على فراشها ، راح الهدهد يتأمل جمالها ويحس بالشفقة في نفسه ، كل هذا الجمال والثراء والقوة ورغم ذلك يسجدون للشمس لقد اضلهم الشيطان ، خدعهم كما يخدع الذين يسجدون لغير الله ، رح الهدهد يفكر في جيش سليمان لو هاجم هذه المملكة صحيح الملكة قوية ، ولكن لن تصمد لجيش سليمان ان جيش الملك قوى ويستطيع اخضاعها وكسر شوكتها في ايام ، تحركت الملكة في فراشها تهم بالنهوض من النوم حدث الهدهد نفسه  هل القي الخطاب الان ام القيه حين تستيقظ ، لم يكن الهدهد يعرف ماذا كتب قائده الاعلى في الخطاب ، اراد ان يعرف فتح فح منقارة فهوى الخطاب يحمله الهواء ، حتى استقر على الملكة ، وفتحت الملكة عينيها وجلست في فراشها فوجدت الخطاب بين يديها ، تلفتت حولها فلم تجد احد . زادت دهشتها وفتحت الخطاب ، وقراته بصوت عالي مسموع ، ” بسم الله الرحمن الرحيم ، الا تعلو على وائتوني مسلمين ” سليمان ، وهم الهدهد بالرحيل فلقد فهم كل شيء ، وقرر ان ينتظر ليرى ماذا سيحدث ، انزعجت الملكة وتلفتت حولها لترى ، من اين جاء الخطاب فلم ترة احد ، زاد انزعاجها واستدعت الحرس ، سالتهم : من الذي جرؤ على دخول غرفتي ، اقسم الحرس لم يدخل احد ، وامرت بلقيس باستدعاء مجلس الشورى على الفور لاجتماع طارىء ، لمناقشة الامر ، اجتمع المجلس وراست الملكة اجتماعها ” قالت : يا أيها الملا إني ألقي الى كتاب كريم ، انه من ليمان وانه بسم الله الرحمن الرحيم ، ألا تعلوا علي وائتوني مسلمين ” سال قائد الجيش ، ألا يقول شيء أخر ، قالت الملكة ، لا شيء غير ما قلته لكم ، قال قائد الجيش ، إنه يامرنا بالاستسلام ، انها الحرب اذا ، قالت الملكة ، ” يا أيها الملأ افتوني في أمرى ما كنت قاطعة أمرا حتى تشهدون ” ، قال قائد الجيش ” نحن اولو قوة وألو بأس شديد ، والأمر اليك فانظري ماذا تأمرين ” ، كانت الاراء في معظمها تميل إلى الحرب ، ولكن الحكيم سأل فجأة : أين الرسول الذي أحضر الخطاب لنفهم منه شيئا عن نوايا سليمان ، قالت الملكة ، لا اعرف من الذي أحضر الخطاب ، سأل الحكيم ، كيف وصل اليك الخطاب مولاتي . قالت رايته في فراشي حين استيقظت من النوم في الصباح ، قال الحكيم  أرى أن نهدأ ونتريث ، إذا كان سليمان قادرا على دخول غرفة الملكة دون حرب فكيف يكون بأسه في الحرب ، أرى أن نتريث ، قالت الملكة ، إنى اتفق معك صمتت لحظة وراحت تفكر ثم قالت ببطىء شديد ” إن الملوك إذا دخلوا قرية افسدوها ، وجعلو اعزة اهلها اذله وكذلك يفعلون ” صمتت برهة اخرى وعادت تقول ، ” واني مرسله اليهم بهديه فناظرة بم يرجع المرسلون ” صدر الامر للصانع الملكى ان يبدأ في صنع تحفه ثمينه لملكة سبأ ، تحفه تصلح أن تكون هدية كريمة لملك كريم ، وصنعت الهدية وارسلت الى سليمان ، بلغت سليمان عليه السلام انباء وصول الرسول بلقيس بهديتهم ، كان الهدهد هو اول من عرف ، كان يطير على حدود مملكة سبأ فرأى قافلة الرسل ، وعاد يحدث سليمان بما رأى ، وادك سليمان من وصف الهدهد لحجم القافله ، أن الملكة الملكة ارسلت وزراءها بالهدية ، فهم انهم جاءوا لمعرفة نواياه ومعرفة قوته العسكرية معا ، وامر سليمان ان يحتشد الجيش كله وان يصطف لاستقبال رسل الملكة . رفض سليمان ان يلتقي برسل الملكة وارسل اليهم ضابط في الجيش يدعوهم الى الغداء في قصر سليمان ، وتصور الرسل انهم سيلتقون بسليمان ، ولكنهم فوجئوا بضابط رتبته أعلى من الاول ، استقبلهم نيابة عن الملك ، وقال لهم ان سليمان لا يستطيع حضور الغداء ويرحب بهم لكنه مشغول بالصلاة والسجود لله . ضغط الضابط على عبارته الاخيرة التي يتحدث فيها عن السجود لله ، وادرك الرسل أن الضابط يشير إشارة مفهومة إلى سجودهم للشمس ، وفوجىء رسل بلقيس أن كل غناهم وثرائهم يبدوا وسط بهاء قصر سليمان شيئا بائسا فقيرا ، وصغرت هدايهم في أعينهم وترددوا أن يفدموها ولكنهم قدموها للضابط الذي حملها إلى غرفة سليمان ثم عاد بها بعد دقائق ، وضع الضابط الهدية على المائدة وقال إن سليمان يرفض الهدية ، سال السفراء لماذا وماذا يريد منا الملك سليمان ، وسوف نبلغ الملكة ، قال الضابط الاسلام ، قال السفراء ، سنبلغ الملكة رساله سليمان ، لقد جئنا للسلام لا للحرب ..  ',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Mohamed2 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة محمد عليه الصلاة والسلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('قصص الأنبياء سيدنا محمد صلى الله عليه وسلم، عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: “إِنَّ إِبْرَاهِيم خَلِيلُ اللَّهِ، وَمُوسَى نَجِيُّ اللَّهِ، وَعِيسَى رُوحُ اللَّهِ وَكَلِمَتُهُ، وَآدَمُ اصْطَفَاهُ اللَّهُ، أَلا وَأَنَا حَبِيبُ اللَّهِ وَلا فَخْرَ”؛ لقد قال فيه رب العباد: “وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ”، لقد أدبه ربه على نهج الإسلام بما جاء بالقرآن الكريم فكان صلى الله عليه وسلم قرآنا يمشي على الأرض. “محمد بن عبد الله بن عبد المطلب” ولد بمكة المكرمة في 12 من ربيع الأول بعام 53 قبل الهجرة (عام الفيل) العام الذي توجه فيه “إبرهة” لهدم الكعبة فحمى الله بيته من المردة الكفرة وأرسل عليهم طيرا أبابيل ترميهم بحجارة من سجيل؛ ينتمي عليه الصلاة والسلام إلى أشرف القبائل (قبيلة قريش) توفي والده “عبد الله بن عبد المطلب” وهو جنين برحم والدته “آمنة بنت وهب”، فقد جاء بالطبقات الكبرى لابن سعد ذكرالآتي: أخبرنا محمد بن عمر بن واقد الأسلمي، قال: حدثني علي بن يزيد، عن عبد الله بن وهب بن زمعة، عن أبيه، عن عمته قالت: كنا نسمع أن رسول الله صلى الله عليه وسلم لما حملت به آمنة بنت وهب، كانت تقول: ما شعرت أني حملت به، ولا وجدت له ثقلة، كما تجد النساء، إلا أني قد أنكرت رفع حيضي، وربما كانت ترفعني وتعود. وأتاني آت وأنا بين النائم واليقظان، فقال: هل شعرت أنك حملت؟ فكأني أقول: ما أدري، فقال: إنك قد حملت بسيد هذه الأمة ونبيها، وذلك يوم الاثنين، قالت: فكان مما يقن عندي الحمل. قال رسول الله صلى الله عليه وسلم: “إني عبد الله في أم الكتاب لخاتم النبيين، وأن آدم لمنجدل في طينته، وسأنبئكم بتأويل ذلك: دعوة أبي إبراهيم، وبشرى عيسى قومه، ورؤيا أمي التي رأت أنه خرج منها نور أضاءت له قصور الشام، وكذلك ترى أمهات النبيين صلوات الله عليهم”. لقد سماه جده “عبد المطلب” محمد وكان آنذاك اسما جديدا كليا بين العرب، وكعادات العرب حينها أخذته “حليمة السعدية” لإرضاعه والتي شهدت خيرا كثيرا بقدومه إليها. لقد شهد الله بكمال عظمته أنه صلى عليه الله وسلم على خلق عظيم، فقد كان كامل الأوصاف خلقا وخلقة، ومهما قيل في وصفه فلن يوفيه شيئا من حقه؛ لقد اجتمعت في شخصيته كل مكارم الأخلاق، لقب قبل رسالته بالصادق الأمين، كان أرحم ما يكون بكل الخلق؛ كان عليه الصلاة والسلام لا يرد أحدا قصده في شيء، شديد التواضع، كان شديد التفاؤل بكل الصعوبات والمآسي التي كان يتعرض لها، من آذاه يسامحه ويسأل عنه ويدعو له بدين الهداية؛ هو النبي الوحيد الذي بكى من أجل أمته. عندما اشتد عضده عمل بالتجارة مع عمه “أبو طالب” الذي اعتنى به بعد وفاة جده “عبد المطلب”، وعندما سمعت السيدة “خديجة بنت خويلد” عن أمانته وصدقه بعثت إليه ليهتم لها بشئون تجارتها الواسعة، فوافق عليه الصلاة والسلام، ومن ثم تزوجها وأنجب منها ذريته الصالحة؛ لقد كان صلى الله عليه وسلم منكرا لعبادة قومه الأصنام ومعرضا عنهم في أفعالهم من شرب الخمور وغيرها مما جعله يعتزل عنهم جميعا ويذهب إلى غار بعيد “غار حراء”، كان يتفكر كثيرا في المخلوقات من حوله وآيات الله المتعددة التي تملأ الكون؛ ولما بلغ من العمر 40 عاما وهو في غار حراء أتاه جبريل عليه السلام ونزل عليه بالآيات: “اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ، خَلَقَ الإِنْسَانَ مِنْ عَلَقٍ، اقْرَأْ وَرَبُّكَ الأَكْرَمُ، الَّذِي عَلَّمَ بِالقَلَمِ، عَلَّمَ الإِنْسَانَ مَا لَمْ يَعْلَمْ”، فذهب إلى السيدة خديجة فطمأنته ومن ثم اصطحبته إلى “ورقة بن نوفل” الذي كان على دراية بأديان السابقين فبشرهما بأنه نبي آخر الزمان. لقد واجه الكثير من الصعوبات والأهوال من قومه أثناء دعوته الشريفة ولكنه صبر على قومه، وأوذي عليه الصلاة منهم كثيرا، جاء في الخبر عن عروة بن الزبير أن عائشة زوج النبي صلى الله عليه وسلم حدثته أنها قالت لرسول الله صلى الله عليه وسلم يا رسول الله هل أتى عليك يوم كان أشد من يوم أحد فقال لقد لقيت من قومك وكان أشد ما لقيت منهم يوم العقبة إذ عرضت نفسي على ابن عبد ياليل بن عبد كلال فلم يجبني إلى ما أردت فانطلقت وأنا مهموم على وجهي فلم أستفق إلا بقرن الثعالب فرفعت رأسي فإذا أنا بسحابة قد أظلتني فنظرت فإذا فيها جبريل فناداني فقال إن الله عز وجل قد سمع قول قومك لك وما ردوا عليك وقد بعث إليك ملك الجبال لتأمره بما شئت فيهم قال فناداني ملك الجبال وسلم علي ثم قال يا محمد إن الله قد سمع قول قومك لك وأنا ملك الجبال وقد بعثني ربك إليك لتأمرني بأمرك فما شئت إن شئت أن أطبق عليهم الأخشبين فقال له رسول الله صلى الله عليه وسلم بل أرجو أن يخرج الله من أصلابهم من يعبد الله وحده لا يشرك به شيئا.',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Youns2 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة يونس عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('قصة حوت يونس عليه السلام واحدة من القصص الشهيرة التي وردت في القرآن الكريم وكان يمثل الحوت فيها أحد الابطال الرئيسيين وبدأت الحكاية مع نبي الله يونس عليه السلام الذي ارسل لقومه للدعوة إلى عبادة الله والايمان به وبواحدانيته. كعادة الدعوات قوبلت دعوة سيدنا يونس عليه السلام بالرفض من قومه وعزف الناس عن اتباع الدعوة ومع ذلك ظل سيدنا يونس عليه السلام على حاله يدعو القوم ولم يتأخر في ذلك ابدًا، ولكن طالت مدة الدعوة وعدم الاستجابة مما اصاب سيدنا يونس عليه السلام بالغضب فكان قراره الغاضب بهجر القرية التي يقيم بها قومه والتوقف عن الدعوة في تلك البلدة ومحاولة استئناف الدعوة في بلد آخر غفل سيدنا يونس عليه السلام في ساعة غضبه عن امر هام ألا وهو أنه نبي لا يتحرك دون امر من الله وهو اتخذ قرار الهجرة وترك قومه دون أن ينتظر الامر من الله بل أنه وضعه موضع التنفيذ وغادر القرية متوجهًا إلى الميناء وهناك قام باستئجار قارب ليقله بعيدًا دون تحديد وجهة محددة كل ما كان يفكر به الابتعاد عن قومه وعن قريته إلى ابعد ما يمكن. بدأت المركب رحلتها وانطلقت تمخر عباب البحر واثناء ما كانت المركب في قلب البحر بدأت عاصفة شديدة ومطر غزير مما صعب حركة المركب وزاد من حمولتها فبدأ المسافرين في التخلص من الامتعة والاحمال الزائدة ولكن ظل حال المركب سئ حيث الحمولة مازالت زائدة، فاعلن ربان المركب أنه يجب أن يتم القاء احد الركاب لتخفيف الحمل وتم ذلك بعد ضرب قرعة وكانت نتيجتها هو سيدنا يونس عليه السلام الذي تقدم والقى بنفسه في البحر. هنا ظهر بطل المشهد الحوت الذي قام بابتلاع سيدنا يونس عليه السلام في جوفه وانطلق إلى أعماق البحر حيث اصبح يونس بذلك اثير ظلمة الليل وظلمة جوف الحوت وظلمة الاعماق السحيقة، وقد اتاحت تلك المحنة لسيدنا يونس عليه السلام أن يبدأ في التفكر والتدبر فادرك ما وقع به من خطأ اثناء غضبه حيث فقد صبره وترك قومه يتيهون في ظلمات الكفر والجهل وتحرك دون امر من ربه. ظل سيدنا يونس عليه السلام بعد أن اكتشف انه مازال على قيد الحياة طوال مدة حبسة في جوف الحوت التي اختلف فيها المفسرين فهناك من قال نهار ومن قال ثلاثة ايام ومن قال سبعة ايام ومن قال اربعين ليلة يواظب على الصلاة وهو يردد ” يا رب، اتخذت لك مسجدا في موضع لم يبلغه أحد من الناس”، والاستغفار والتسبيح فيقول “لا إله إلا أنت سبحانك إنى كنت من الظالمين .. لا إله إلا أنت سبحانك إنى كنت من الظالمين .. لا إله إلا أنت سبحانك انی کنت من الظالین”، إلى ان امر الله بانتهاء مدة حبس سيدنا يونس عليه السلام في جوف الحوت، فكما امر الله الحوت بابتلاع يونس أمر بأن يلقيه على الشاطئ واطاع الحوت ونفذ الامر فلفظ يونس على أحد الشواطئ، وكان سيدنا يونس عليه السلام عاري وجسمه متقرح بسبب تواجده داخل جوف الحوت وتعرضه للعصارة في جوفه. فانبت الله فوقه شجرة من اليقطين أو القرع الذي اتاح له أن يأكل ثمارها ويتداوى باوراقها ويستر نفسه بها إلى أن تم شفاء جسده واستعاد عافيته وعاد إلى قومه، فكان الحوت بذلك مكان سجن لسيدنا يونس عليه السلام ومدرسة أو آداة لتعليمه وتذكيره بعظمة الخالق قال عز وجل وَإِنَّ يُونُسَ لَمِنَ الْمُرْسَلِينَ (139) إِذْ أَبَقَ إِلَى الْفُلْكِ الْمَشْحُونِ (140) فَسَاهَمَ فَكَانَ مِنَ الْمُدْحَضِينَ (141) فَالْتَقَمَهُ الْحُوتُ وَهُوَ مُلِيمٌ (142) فَلَوْلَا أَنَّهُ كَانَ مِنَ الْمُسَبِّحِينَ (143) لَلَبِثَ فِي بَطْنِهِ إِلَىٰ يَوْمِ يُبْعَثُونَ (144)  فَنَبَذْنَاهُ بِالْعَرَاءِ وَهُوَ سَقِيمٌ (145) وَأَنبَتْنَا عَلَيْهِ شَجَرَةً مِّن يَقْطِينٍ (146) وَأَرْسَلْنَاهُ إِلَىٰ مِائَةِ أَلْفٍ أَوْ يَزِيدُونَ (147)” ( الصافات من 139 إلى 147 ).',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Essa extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة عيسي عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('سيدنا عيسى عليه السلام رسول من الله سبحانه وتعالي بعثه الله عز وجل برسالة التوحيد وحمل الانجيل وكانت ولادته في حد ذاتها معجزة حيث حملت به والدته دون ان يمسسها بشر، وبشرها به جبريل عليه السلام وأخبرها انه سيكون رسولاً ونبياً من الله سبحانه وتعالي دون أن يكون له أب، وقد تكلم امام الناس في المهد صبياً وقد ولد رسول الله عيسى عليه السلام في المكان الذي يعرف اليوم باسم بيت لحم وهو جزء من فلسطين المحتلة ، ويسعدنا ان نستعرض معكم اليوم في هذا المقال من موقع قصص واقعية قصة سيدنا عيسى عليه السلام مكتوبة بشكل مختصر ومبسط لجميع الاعمار ننقلها لكم من قسم قصص الأنبياء. رغم المعجزات الباهرة التي جاء بها عيسى عليه السلام فإن اليهود كانوا قساة القلوب فأخذوا يعملون على منع الناس من سماع دعوته وبدؤوا بحيكون المؤامرات ضده واخذوا يحرضون الرومان ويوهمونهم أن في دعوة عيسی زوالا لملك قيصر الروم وتقويضا لسلطانه واخيرا ذهب فريق من هؤلاء اليهود الى الحاكم الروماني في فلسطين (بيلاطوس ) وقالوا له : إن عيسي يقول كلاما يمس أمن امبراطوريتكم العظيمة !! اضطرب الحاكم الروماني وأصدر أوامره على الفور بالقاء القبض على عيسى وصلبه جزاء وعقابا على افتراءاته . أخذ جند الرومان يبحثون عن عيسى في كل مكان وكان من أصحابه رجل منافق اسمه (يهوذا ) وشی به فألقى الله عليه شبه عیسی فقبض عليه الجنود وأرتج عليه وأسكته الله فنفذ فيه الحاكم الروماني حكم الصلب وسط صيحات من الصراخ والاستنجاد من يهوذا بأنه ليس عيسى ولكن صوته كان يضيع وسط ضجيج آلاف من الناس أحتشدوا لرؤية صلب عيسى عليه السلام . وهكذا يا احباءنا لم يستطع اليهود الحاقدون أن ينالوا من نبي الله عيسى ولنسمع في ذلك قول الله عز وجل : .وبكفرهم وقولهم على مريم بهتانا عظيما وقولهم إنا قتلنا المسيح عيسى ابن مریم رسول الله وما قتلوه وما صلبوه ولكن شبه لهم وان الذين اختلفوا فيه لفي شك منه مالهم به من علم الا اتباع الظن وماقتلوہ یقینا بل رفعه الله اليه ، وإذا كان عيسى بن مريم عليه السلام لم يصلب كما اخبرنا بذلك سبحانه وتعالى فماذا حصل له ؟ والجواب على ذلك يا أحباءنا كما اخبرنا القرأن الكريم بل رفعه الله اليه ، نعم رفع الله عيسى عليه السلام الى السماء معززا مكرما لم يمسسه أي أذى من اليهود الحاقدين وسينزله الى الارض ثانية في آخر الزمان عندما يقترب يوم القيامة ليكسر الصليب ويقتل الخنزير ويمنع الخمر ويقتل المسيح الدجال الذي يدعي أنه عیسی كذبا على الله وعلى الناس ويدعو النصارى إلى اتباع دين الاسلام ويملأ الدنيا عدلا وامنا وعندها يمكث نبي الله عیسی عليه السلام أربعين سنة في الأرض ثم يتوفاه الله عز وجل فيصلي عليه المسلمون .',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Houd2 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة هود عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('كان الجزء الجنوبي من شبه الجزيرة العربية يسري فيه الخير سريان الدم في الجسد، وكانت الأرض خصبة، وكانت هناك ينابيع متفرقة، وكان الله يسقط عليها الأمطار في أوقات منتظمة من السنة، فكانت تلك الأرض المباركة يتمنى كل إنسان العيش بها فكانت تسمى بالأحقاف، وكان هناك رجلا يسمى عاد ابن أرم، وكان ذكيا وشجاعا لطالما سمع عن تلك الأراضي وما بها من خيرات ونعيم ظاهر، فأخذ زوجته وأبناءه ورحل إلى تلك الجنة التي لطالما حلم بالعيش بها، وعندما استقر هناك ووجد الخير الذي لم يسبق له رؤيته شيد دارا له ولأبنائه ومنذ ذلك الوقت أصبحت الأحقاف ملكا لقوم عاد، ومرت السنوات وتكاثروا وأصبحوا كثر وصاروا ثلاثة عشرة قبيلة. كانوا قوم عاد يتسمون بكبر البنيان والقوة، فقد بارك الله لهم في أجسامهم كما بارك لهم في أرضهم، ولما كثرت في أيديهم أمر ملكهم ببناء مدينة وسماها أرم نسبة إلى جدهم الأكبر، ولم تشيد تلك المدينة بالطوب اللبن ولكن بقطع من الذهب والفضة وكانت عالية المباني يحيطها سور ضخم، واستغرق بناء تلك المدينة ما يقارب خمسمائة عام، فكان بينهم الفقير والغني، والقوي والضعيف، وكان القوي يبطش بالضعيف، وانتشر وعم الفساد ونسوا عبادة الله عز وجل وعادوا لعبادة الأصنام التي صنعوها من الحجارة والخشب. فأرسل الله لهم نبي الله هود عليه السلام ليدعوهم إلى التوحيد، وكان قد اشتهر نبي الله هود عليه السلام بالتقوى والصلاح، فأخذ يدعوهم واحدا تلو الآخر ليلا ونهارا، ويحذرهم من عقاب الله وغضبه، ويذكرهم بما حدث مع قوم نوح عليه السلام، ولكن ابتعدوا كل البعد عن دعوة هود عليه السلام، قال تعالى: ” قَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِن قَوْمِهِ إِنَّا لَنَرَاكَ فِي سَفَاهَةٍ وَإِنَّا لَنَظُنُّكَ مِنَ الْكَاذِبِينَ، قَالَ يَا قَوْمِ لَيْسَ بِي سَفَاهَةٌ وَلَٰكِنِّي رَسُولٌ مِّن رَّبِّ الْعَالَمِينَ، أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنَا لَكُمْ نَاصِحٌ أَمِينٌ، أَوَعَجِبْتُمْ أَن جَاءَكُمْ ذِكْرٌ مِّن رَّبِّكُمْ عَلَىٰ رَجُلٍ مِّنكُمْ لِيُنذِرَكُمْ ۚ وَاذْكُرُوا إِذْ جَعَلَكُمْ خُلَفَاءَ مِن بَعْدِ قَوْمِ نُوحٍ وَزَادَكُمْ فِي الْخَلْقِ بَسْطَةً ۖ فَاذْكُرُوا آلَاءَ اللَّهِ لَعَلَّكُمْ تُفْلِحُونَ”، فأصابهم الله عز وجل بالجدب؛ فجفت المياه وذبلت الأشجار، وتساقطت الثمار وماتت الأنعام وجميع الماشية. وهنا شعر نبي الله هود عليه السلام أن ذلك كله مقدمات لعذاب الله عز وجل، فذهب يدعوهم ليلا ونهارا ويدعوهم لعبادة الله وحده وعدم الشرك به، ولكن حال ذلك دون جدوى من نبي الله، وظلوا في كفرهم، قال تعالى: ” قَالُوا أَجِئْتَنَا لِنَعْبُدَ اللَّهَ وَحْدَهُ وَنَذَرَ مَا كَانَ يَعْبُدُ آبَاؤُنَا ۖ فَأْتِنَا بِمَا تَعِدُنَا إِن كُنتَ مِنَ الصَّادِقِينَ، قَالَ قَدْ وَقَعَ عَلَيْكُم مِّن رَّبِّكُمْ رِجْسٌ وَغَضَبٌ ۖ أَتُجَادِلُونَنِي فِي أَسْمَاءٍ سَمَّيْتُمُوهَا أَنتُمْ وَآبَاؤُكُم مَّا نَزَّلَ اللَّهُ بِهَا مِن سُلْطَانٍ ۚ فَانتَظِرُوا إِنِّي مَعَكُم مِّنَ الْمُنتَظِرِينَ”، وبعد أيام قليلة أقبلت السحب لتغطي السماء ففرحوا ورقصوا، وذهبوا إلى نبي الله هود عليه السلام شامتين مهللين وأخبروه بأن الخير قادم مع قدوم المطر الذي سوف يملأ الوديان، ولكن أخبرهم هود عليه السلام بأن فيها ريح وعذابا أليم. خرج نبي الله هود عليه السلام ومن معه من عاد لينجيهم من الهلاك القادم على قوم عاد، قال تعالى: “فَأَنجَيْنَاهُ وَالَّذِينَ مَعَهُ بِرَحْمَةٍ مِّنَّا وَقَطَعْنَا دَابِرَ الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۖ وَمَا كَانُوا مُؤْمِنِينَ”؛ بعد وقت قصير أرسل الله عليهم عواصف شديدة قلعت المنازل والأشجار وكل ما تقابله، واستمر حال هذه العواصف الشديدة سبع ليالي وثمانية أيام متصلة، وبعدها هدأت تلك الرياح العاتية لتصبح الأحقاف ليس كما كانت عليه بل أصبحت صحراء خاوية لا تحوي شيء',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Saleh extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة صالح عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('ثمود هي إحدي القبال التي كانت تسكن منطقة الجزيرة العربية، وكانت ثمود مثل قوم عاد يعصون الله ولا يؤمنون به، فأرسل الله لهم نبيه صالح عليه السلام لكي يدعوهم إلى توحيد الله عز وجل وطاعته والبعد عن معصيته قال تعالى ” وَإِلَى ثَمُودَ أَخَاهُمْ صَالِحًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ هُوَ أَنْشَأَكُمْ مِنَ الأَرْضِ وَاسْتَعْمَرَكُمْ فِيهَا فَاسْتَغْفِرُوهُ ثُمَّ تُوبُوا إِلَيْهِ إِنَّ رَبِّي قَرِيبٌ مُجِيبٌ ولكن قوم ثمود مثل غيرهم من الأمم السابقة التي ضلت وحادت عن عبادة الله واستغواهم الشيطان، رفضوا دعوة سيدنا صالح لهم ورفضوا توحيد الله عز وجل وأصروا على عبادة غيره، بل إنهم أنكروا على سيدنا صالح أنه دعاهم إلى عبادة الله تعالى، قال تعالى ” قَالُوا يَا صَالِحُ قَدْ كُنْتَ فِينَا مَرْجُوًّا قَبْلَ هَذَا أَتَنْهَانَا أَنْ نَعْبُدَ مَا يَعْبُدُ آَبَاؤُنَا وَإِنَّنَا لَفِي شَكٍّ مِمَّا تَدْعُونَا إِلَيْهِ مُرِيبٍ”، انظر كيف تحول أدبهم في أول الآية من اجل استميال سيدنا صالح لهم فقالوا له ” قد كنت فينا مرجوا قبل هذا” ومعناه أنه كانت لك مكانة كبيرة بيننا، يقولون له هذا لكي يصرفوه عن دعوته، ثم عادوا لتكذيبة والإقلال من دعوته بقولهم ” وَإِنَّنَا لَفِي شَكٍّ مِمَّا تَدْعُونَا إِلَيْهِ مُرِيبٍ” ولم ييأس نبي الله صالح عليه السلام من دعوتهم، بل كان صابرا مثل باقي رسل الله عليهم السلام فاستمر يدعوهم لتوحيد الله، لكنهم كذلك ظلوا على كفرهم وعنادهم، إلى أن طلبوا منه أن يأتيهم بمعجزة من عند الله تثبت لهم صدقه ، وكغيرهم لم يطلبوا المعجزة لكي يؤمنوا بها بل من أجل تعجيز الرسول أو النبي ظننا منهم أنه كاذب. لكن الله خيب ظنهم وأقام عليهم الحجة وأخرج لهم آية ومعجزة جعلت افواههم فاغرة، فأخرج الله لهم ناقة حية من الجبل الأصم، ناقة تخرج من الجبل لا أب لها ولا أم ، ناقة خلقت في الجنة فكانت الناقة اية واعجاز اقام عليهم الحجة والدليل قال تعالى ” وَيَا قَوْمِ هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ قَرِيبٌ”،فآمن بسيدنا صالح بعض من قومه ولم يؤمن اغلب القوم رغم رؤيته للاية التي ارسلها الله لهم. وجاء أمر الله لقوم سيدنا صالح عليه السلام بشأن الناقة أن اتركوها ترعي في أرض الله وأن لا يتعرض لها أحد بأي سوء، وأن يكون لها يوم تشرب فيه وحدها من البئر واليوم الثاني لقوم سيدنا صالح وأغنامهم وحيواناتهم قال تعالى “قَالَ هَذِهِ نَاقَة لَهَا شِرْب وَلَكُمْ شِرْب يَوْم مَعْلُوم “، وكانت الناقة تدر لبنا يكفي لإطعام القبيلة بأكملها حتي يشبعوا. وكعادة القوم الكافرين دائما يوجد الحقد والغل في قلوبهم، فرغم رؤيتهم للناقة تخرج من رحم الحجارة الصماء، ورغم رؤيتهم لكمية اللبن التي تدرها الناقة إلا أنهم كانوا ينقمون عليها وعلى وليدها، فالناقة بعد ثلاثة ايام ولدت فصيلا صغيرا وكان يشرب معها في نفس اليوم. قرر القوم الكافرين والمفسدين أن يقتلوا الناقة، وكان هناك 9 أشخاص سهروا في إحدى الليالي وأكلوا حتي الشبع وشربوا الخمر حتى غابت عقولهم وسكروا، فقرروا في لحظتها أن يقوموا بقتل ناقة الله التي أرسلها لهم آية، فهم واحد منهم وهو أشقى شخص وأكثرهم إجراما وقام بذبح الناقة وكان هذا الرجل يدعى قيدار الشقي، ولم يكتفي هذا الشقي بقتل الناقة، بأخذ يجري وراء فصيلها الصغير يريد قتله، وكان الفصيل يجري يبحث عن مكان يختبئ فيه من هذا المجرم فصعد الجبل لكن هذا المجرم الشقي قيدار تمكن من الفصيل الصغير وطعنة بالخنجر كما طعن امه وذبحها، وسالت دماء الصغير كما سالت دماء أمه من قبله. في الصباح استيقظ القوم المؤمنين مع سيدنا صالح فوجدوا الناقة غارقة في دمائها ووجودا فصيلها ساقط من قمت الجبل وسابح في دمائه هو الآخر، فغضب سيدنا صالح وأخبر المجرمين بعقاب الله لهم وأن ينتظروا عقاب الله الذي سيأتيهم خلال ثلاثة أيام، وخرج سيدنا صالح والذين امنوا معه من ديار الكفار وبالفعل في اول يوم غطت السماء سحب سوداء كثيفة ولم يمر اليوم الثالث الا واستيقظ القوم على صوت صيحة عظيمة لم يتحملها أحد منهم هدمت فوقهم دورهم وقصورهم ومنازلهم وقضت عليهم جميعا، ونجى الله سيدنا صالح ومن آمن معه من العذاب الذي حل بالمشركين المجرمين.',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class Elyas extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة إلياس  عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('أرسل إلى أهل بعلبك غربي دمشق فدعاهم إلى عبادة الله وأن يتركوا عبادة صنم كانوا يسمونه بعلا فآذوه، وقال ابن عباس هو عم اليسع قال تعالى في سورة (الصافات): وَإِنَّ إِلْيَاسَ لَمِنْ الْمُرْسَلِينَ (123) إِذْ قَالَ لِقَوْمِهِ أَلَا تَتَّقُونَ (124) أَتَدْعُونَ بَعْلًا وَتَذَرُونَ أَحْسَنَ الْخَالِقِينَ (125) اللَّهَ رَبَّكُمْ وَرَبَّ آبَائِكُمُ الْأَوَّلِينَ (126) فَكَذَّبُوهُ فَإِنَّهُمْ لَمُحْضَرُونَ (127) إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ (128) وَتَرَكْنَا عَلَيْهِ فِي الْآخِرِينَ (129) سَلَامٌ عَلَى إِلْ يَاسِينَ (130) إِنَّا كَذَلِكَ نَجْزِي الْمُحْسِنِينَ (131) إِنَّهُ مِنْ عِبَادِنَا الْمُؤْمِنِينَ هذه الآيات القصار هي كل ما يذكره الله تعالى من قصة إلياس.. لذلك اختلف المؤرخون في نسبه وفي القوم الذين أرسل إليهم.. فقال الطبري أنه الياس بن ياسين بن فنحاص بن العيزار بن هارون.. أما ابن كثير فيقول أن إلياس والياسين اسمين لرجل واحد فالعرب تلحق النون في أسماء كثيرة وتبدلها من غيرها. أما دعوته فسنذكر أشهر الروايات عنها: إن الياس عليه السلام لما دعا بني إسرائيل الى نبذ عبادة الأصنام ، والاستمساك بعبادة الله وحده رفضوه ولم يستجيبوا له ، فدعا ربه فقال : اللهم إن بني إسرائيل قد أبو إلا الكفر بك والعبادة لغيرك ، فغير ما بهم من نعمتك فأوحي الله إليه إنا جعلنا أمر أرزاقهم بيدك فأنت الذي تأمر في ذلك، فقال إلياس: اللهم فأمسك عليهم المطر فحبس عنهم ثلاث سنين ، حتى هلكت الماشية والشجر ، وجهد الناس جهداً شديداً ، وما دعا عليهم استخفي عن أعينهم وكان يأتيه رزقه حيث كان فكان بنو إسرائيل كلما وجدوا ربح الخبز في دار قالوا هنا إلياس فيطلبونه ، وينال أهل المنزل منهم شر وقد أوي ذات مرة إلى بيت امرأة من بنى إسرائيل لها ابن يقال له اليسع بن خطوب به ضر فآوته واخفت أمره. فدعا ربه لابنها فعافاه من الضر الذي كان به واتبع (إلياس) وأمن به وصدقه ولزمة فكان يذهب معه حيثما ذهب وكان (إلياس) قد أسن وكبر ، وكان اليسع غلاماً شاباً ثم إن (الياس) قال لبني إسرائيل إذا تركتم عبادة الأصنام دعوات الله أن يفرج عنكم فأخرجوا أصنامهم ومحدثاتهم فدعا الله لهم ففرج عنهم وأغاثهم ، فحييت بلادهم ولكنهم لم يرجعوا عما كانوا عليه ولم يستقيموا فلما رأي (إلياس) منهم دعا ربه أن يقبضه إليه فقبضة ورفعه. ويذكر (ابن كثير ) أن رسالته كانت لأهل بعلبك غربي دمشق وانه كان لهم صنم يعبدونه يسمي (بعلا) وقد ذكره القرآن الكريم على لسان إلياس حين قال لقومه ( أَتَدْعُونَ بَعْلًا وَتَذَرُونَ أَحْسَنَ الْخَالِقِينَ (125) وَاللَّهَ رَبَّكُمْ وَرَبَّ آبَائِكُمُ الْأَوَّلِينَ ). ويذكر بعض المؤرخين أنه عقب انتهاء ملك (سليمان بن داود ) عليه السلام وذلك في سنة 933 قبل الميلاد انقسمت مملكة بن إسرائيل إلى قسمين، الأول ، يخضع لملك سلالة (سليمان) وأول ملوكهم (رحبعام بن سليمان والثاني يخضع لاحد اسباط افرايم بن يوسف الصديق واسم ملكهم جر بعام . وقد تشتت دولة بنى إسرائيل بعد (سليمان عليه السلام بسبب اختلاف ملوكهم وعظمائهم على السلطة ، وبسبب الكفر والضلال الذي انتشر بين صفوفهم وقد سمح أحد ملوكهم وهو (أخاب) لزوجته بنشر عبادة قومها في بني إسرائيل ، وكان قومها عباداً للأوثان فشاعت العبادة الوثنية ، وعبدوا الصنم الذي ذكره القرآن الكريم واسمه (بعل) فأرسل إليهم (الياس) عليه السلام الذي تحدثنا عن دعوته فما توفي (إلياس) عليه السلام أوحي الله تعالى إلى أحد الأنبياء واسمه (اليسع ) عليه السلام ليقوم في نبي إسرائيل ، فيدعوهم إلى عبادة الله الواحد القهار. وأرجح الآراء إن إلياس هو النبي المسمى إيليا في التوراة ',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}
class yahia extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('قصة يحيى  عليه السلام',style: TextStyle(fontSize: 25),),
        centerTitle: true,
       backgroundColor: Colors.blue[900],
      ),
      body: Container(
        width: MediaQuery.of(context).size.width * 1.0,
        margin: EdgeInsets.only(bottom: 20),

        child: ListView(
          children: <Widget>[
            Container(
              padding: EdgeInsets.all(10),
              color: Colors.white,
                margin: EdgeInsets.only(bottom: 20),
              width: MediaQuery.of(context).size.width * 1.0,
              child: Text('يحيى عليه السلام هو نبي الله الذى شهد الحق عز وجل له أنه لم يسم باسمه أحد من قبل « يا زكريا إنا نبشرك بغلام اسمه يحيى لم نجعل له من قبل سميا ، هو النبى الذى قال الحق عنه « وحنانا من لدنا وزكاة وكان تقيا ، ومثلما أوتى الخضر علما من لدن الله ، أوتى يحيى عليه السلام حنانا من لدن الله ، والحنان هو العلم الشمولي الذى يشيع فى نسيجه حب عميق للكائنات ورحمة بها ، لقد كان يحيى فى الأنبياء نموذجا لا مثيل له فى النسك والزهد والحب الإلهي ، فهو النبى الناسك كان يضىء حبا لكل الكائنات. وأحبه الناس وأحبته الطيور والوحوش والصحارى والجبال ، ثم أهدرت دمه كلمة حق قالها فى بلاط ملك ظالم كان يحيى عليه السلام معاصرا لعيسى وقريبه من جهة الأم (ابن خالته) وتروى السنة أن يحيى وعيسى التقيا يوماً فقال عيسى ليحيى: استغفر لى يا يحيى ، أنت خير منى. قال يحيى : استغفر لى يا عيسى ، أنت خير منى. قال عيسى: بل أنت خير منى ، سلمت على نفسى وسلم الله عليك. « وسلام عليه يوم ولد ويوم يموت ويوم يبعث حيا ولد يحيى عليه السلام وسط عصر يمتلىء بقمم النقاء كما يمتلىء بقمم الطغيان ، وكانت السيدة مريم تمثل قمة النقاء فى هذا العصر ، إن محرابها المعطر المغلق يكاد يضىء بكلمات الصلاة المستمرة والذكر الخاشع والقلب الطاهر ، كان ميلاد يحيى عليه السلام معجزة ، فقد جاء لأبيه زكريا عليه السلام بعد عمر طويل حتى كاد ييئس فيه الشيخ من الذرية. جاء بعد دعوة نقية تحرك بها قلب النبى زكريا. كان يحيى عليه السلام يطعم الحيوانات والطيور من طعامه رحمة بها وحنانا عليها ، ويبقى هو بغير طعام أو يأكل من أوراق الشجر وثمارها ، وكلما كبر يحيى عليه السلام فى السن زاد النور فى وجهه وامتلأ قلبه بالحكمة وحب الله والمعرفة والسلام وزادت رحمته وحنانه بوالديه والناس والمخلوقات والطيور والحيوانات والأشجار حتى عم حنانه الدنيا وملأها بالرحمة. وعندما صار صبيا نادته رحمة ربه « يا يحيى خذ الكتاب بقوة وآتيناه الحكم صبيا فقد رزقه الله الإقبال على معرفة الشريعة والقضاء بين الناس وهو صبى. كان يحيى عليه السلام أعلم الناس وأشدهم حكمة فى زمانه ، درس الشريعة دراسة كاملة. لهذا آتاه الله الحكم صبيا ، كان يحكم بين الناس ويبين لهم أصول دينهم ويعرفهم طريق الصواب ويحذرهم من الطريق الخطأ. كان يحيى عليه السلام يدعو الناس إلى التوبة من الذنوب ، ولم يكن هناك إنسان يكره أو يتمنى له الضرر ، كان يخرج إلى الجبال والحقول والصحراء فيمكث فيها شهورا متعاقبة يعبد الله ويبكى بين يديه ويصلى له ، فكان ينام فى أى مغارة فى الجبل ، ومن كثر انشغاله فى ذكر الله كان إذا دخل عليه وحش وذئب من الجبل كان لا يلتفت إليه ويغادر الوحش المكان دون أن يحس به يحيى عليه السلام جاء صباح خرج فيه سيدنا يحيى عليه السلام على الناس ليدعوهم إلى الله وقال لهم إن الله عز وجل أمرنى بكلمات أعمل بها ، وآمركم أن تعملوا بها ، وأن تعبدوا الله وحده بلا شريك فمن أشرك بالله وعبد غيره فهو مثل عبد اشتراه سيده ، وقال لهم إن الله أمركم بالصلاة فإن الله ينظر إلى عبده وهو يصلى ما لم يلتفت عن صلاته ، فإذا صليتم فاخشعوا وآمركم بالصيام وآمركم بذكر الله عز وجل. كان إذا وقف بينهم يحدثهم أبكاهم من الحب والخشوع ، انتهى يحيى عليه السلام من كلامه فهبط من المنبر وسار عائداً إلى الصحراء ، ووقع الصدام بين سيدنا يحيى والسلطات الحاكمة فى ذلك الوقت. كان أحد ملوك هذا الزمان طاغية وكان يريد أن يتزوج من أحد محارمه ، فسأل يحيى عليه السلام هل يجوز أن يتزوجها ، فقال له لا يجوز ، طلب منه الملك أن يجد له فتوى ترضيه ، رفض نبى الله أن يوافق الملك على رغبتة فزاد غضب الملك على يحيى عليه السلام فأمر بسجنه ، فذهبت إلى يحيى عليه السلام فى سجنه المرأة التى كان الملك يريد أن يتزوجها فأحست بنبل وجلال شخصيته ، شاهدته يجلس منهمكا فى الصلاة والبكاء راقبته وهو يصلى حتى انتهى من صلاته ألقت بنفسها أمامه وسألته أن يحبها قال لها يحيى عليه السلام "ليس فى قلبى مكان لحب غير حب الله" ، نهضت المرأة يائسة وانصرفت عنه وقد امتلأ قلبها بكراهيته ، عادت إلى قصر الملك وطلبت منه أن يقتل يحيى بن زكريا ، وكان المك مخمورا وأصدر قرارا إلى حاشيته أن يقتلوا يحيى بن زكريا.  ',
                style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
            )]
          ,),
            ),);



  }
}


