import 'dart:ui' as prefix0;
import 'package:flutter/material.dart';
class Qesas extends StatelessWidget {
  Color color=Colors.red;
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.black,
      appBar: AppBar(
        centerTitle: true,
        backgroundColor: Colors.blue[900],
        title: Text('قصص اطفال',style:TextStyle(fontSize: 23,fontWeight: prefix0.FontWeight.bold,color: Colors.white),),
      ),
      body:  ListView(
      children: <Widget>[
        Container(
      color: Colors.black,
          width: MediaQuery.of(context).size.width * 1.0,
          child:Column(
            children: [

              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(الثعلب والأسد المريض) '
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text('يحكى أن أسد كان يحكم الغابة لسنوات طويلة وكانت جميع الحيوانات تهابه وتطيع أوامره وكان الأسد يحصل على طعامه بالقوة يطارد الفريسة ويهجم عليها ويفترسها بأنيابه الحادة ولا يتركها حتى يشبع ثم تأتي الحيوانات وتأكل من بقايا طعامه كبر الأسد وصار عجوزاً ضعيفاً وذات يوم شعر بالمرض وأحس بالضعف الشديد وأصبح غير قادر على أن يصطاد شعر الأسد بالجوع وراح يفكر في طريقة يحصل فيها على طعامه. قال الأسد لنفسه ما زالت الحيوانات تحترمني وتخافني وتسمع كلامي لا ينبغي أبداً أن أظهر لها أنني أصبحت كبير السن ضعيفاً وإلا فإنها لن تخشاني ولن تطيع أوامري لكن سأعلن عن مرضي وأبقى داخل بيتي ولا بد أن تحضر الحيوانات لزيارتي وبذلك سيأتيني طعامي من غير أن أتعب نفسي في الحصول عليه نشر الأسد خبر مرضه بين الجميع , وكانت الحيوانات تخاف غضب الأسد وبطشه إن هي لم تقم بالواجب لذلك سارعت الحيوانات إلى زيارته في بيته والسؤال عنه والدعاء له بالشفاء لكن كلما دخل حيوان بيت الأسد هجم عليه وفتك به وأكله كان الأسد سعيداً لأنه لا يتعب في الحصول على طعامه فهو لم يعد قادراً على أن يطارد أي حيوان مهما كان بطيئاً لكن الطعام اللذيذ كان يأتي إليه في بيته وهو جالس لا يتحرك فيأكل منه حتى يشبع وفي يوم من الأيام كان الدور على الثعلب ليزور الأسد ويسأله عن صحته ويطمئن على حاله توجه الثعلب إلى بيت الأسد وهم بالدخول لكنه نظر إلى الأرض عند مدخل البيت وتوقف سأل الثعلب الأسد عن حاله وهو واقف في مكانه خارج البيت أجاب الأسد ما زلت مريضاً يا صديقي الثعلب غير أن صحتي تتقدم وتتحسن يوماً بعد يوم لكن لماذا تقف بعيداً أدخل يا صديقي لأستمتع بحديثك الحلو وكلامك الجميل فأجابه الثعلب لا يا صديقي الأسد كان بودي أن أدخل بيتك لانظر إليك من قرب لكني ((أرى آثار أقدام كثيرة تدخل بيتك ولم أرى أثر لقدم واحدة خرجت منه)) ثم عاد تاركا الاسد بغيظه و جوعه',
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('( قصة تلميذ أمين)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("ذات يوم من الأيام ، كان هناك طالب ، اسمه خالد ، كان يلعب ، أثناء فترة الاستراحة ، في فناء مدرسته ، مع أصدقائه ، وبينما كان خالد يجري هو ، وأصدقاؤه ، إذ وقعت عيناه على مبلغ معين من المال ، الموجود على الأرض ، فقام على الفور بالتقاطه ، ومن ثم نظر خالد إلى صديقه ، الذي اسمه فارس ، وقد كان يقف خلفه قال خالد لفارس : ” لقد عثرت على هذا المال على الأرض يا صديقي ، لا بد أن أذهب به ، على الفور ، إلى مكتب المدير ، حتى أعطيه هذا المال ، الذي عثرت عليه ” ، فرد عليه فارس ، قائلًا : ” ولماذا يا صديقي لا تأخذ هذا المال لك ؟ ” ، لقد وجدت المال على الأرض ، فهذا المال من حقك غضب خالد للغاية ، من حديث صديقه فارس ، ورد عليه بصوت حزين ، مملوء بالأسى : ” وهل هذا ما تعلمناه بخصوص الأمانة يا فارس ؟ ألم تنصت إلى حديث معلمنا ، الذي شرح لنا فيه أهمية الأمانة ، وأنها لا ترتبط بأي شيء ، لا مكان ، ولا زمان ، فالأمانة هي نفسها الأمانة ، مهما كان واستأنف خالد ، قائلًا : ” إن هذا المال لا ينبغي أن يكون لي ، فهو ليس من حقي ، فلا بد أن نسأل عن صاحبه ، في إدارة المدرسة ” ، هنا شعر فارس بالحياء ، والخجل من صديقه ، فقال فارس لخالد : ” أعتذر منك يا خالد ، فأنا لم أقصد أخذ مال الغير ، فكرت فقط ، أنه لا صاحب له رد خالد ، قائلًا : ” لا يوجد أي شيء ، بدون صاحب ، وحتى إن لم يظهر للمال صاحب ، فسأكون فعلت الذي يتوجب علي فعله ، وليتصرف المدير بشأن هذا الأمر ، فهو المسئول الأول ، وبالتأكيد ، سيفعل المدير ما يراه صحيحًا ” ، ومن ثم اتجه إلى المدير ، وحكى له أمر المال شكر المدير خالد على أمانته ، وبدأ المدير بالإعلان عن المال المفقود ، في المدرسة ، وقد أخبر الجميع بأن يأخذوا حرصهم على ممتلكاتهم ، وأخبرهم بأنه يجب على الذي فقد مبلغًا من المال ، أن يخبره بمواصفاته ، حتى يتأكد من أنه صاحب المال وبالفعل فقد اكتشف تلميذ فقد مصروفات الكتب ، الخاصة به ، وأخبر المدير بما فقده ، فتأكد المدير من صاحب المال ، وطلب المدير من طلاب المدرسة ، تقديم الشكر إلى التلميذ خالد الأمين . ",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('( القرد الحزين )'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("يحكى أنه ، في قديم الزمان ، كانت تعيش مجموعة من القرود في الغابة ، وقد كان من بينهم قرد صغير ، كان دومًا حزين ، وكثيرًا ما كان يبكي ، حيث أن الله ، سبحانه وتعالى ، كان قد خلقه بدون ذيل ، مثل بقية القرود في الغابة ،  كان ذلك يؤرقه ، حيث لم يكن يستطيع أن يتسلق الأشجار ، ولا أن يتأرجح فوقها ، كعادة القرود  وكانت القرود تسخر منه ، وكثيرًا ما يضحكون عليه ، ويخبرونه بأنه ليس كباقي القرود ، ولم يكونوا يلعبون معه ، وكان ذلك القرد الحزين المسكين ، يلعب وحده أسفل الشجرة ، وكان للقرد كلب صديقه ، كان يجلس معه تحت الشجرة وذات يوم ، لاحظ الكلب أن القرد حزين ، فسأله عما به ، فأخبره القرد ، بأنه حزين ، لأن القرود لا تلعب معه ، فأخبره الكلب ، بأن يحمد الله ، حيث أن الله رزقه سرعة مهولة ، تمكنه من الركض ، أسرع من باقي القرود ، إلا أن القرد لم يقتنع ذهب القرد إلى أمه ، وأخذ يبكي ، ويسألها عن سبب خلقه بتلك الطريقة ، فأخبرته الأم ، أن يحمد الله ، ولا يفكر بتلك الطريقة ، إلا أنه لم يحمد ربه ، وقرر القرد أن يذهب بنفسه ، إلى حكيم الغابة ، وهو الفيل ، ليطلب منه ذيلًا ، وأثناء سير القرد في الطريق ، وجد الكلب صديقه فسأله الكلب ، وقال : ” إلى أين تذهب أيها القرد ؟ ” ، فرد القرد قائلًا : ” إلى حكيم الغابة ، لأطلب منه ذيلًا طويلًا ” ، اندهش الكلب ، وأخبر القرد قائلًا : ” إن ما تفعله خطأ ، فأنت بذلك تعترض على قضاء الله ” ، فقال القرد : ” لا تتدخل أيها الكلب ، واتركني وشأني ذهب القرد إلى حكيم الغابة ، فوجد حجمه صغيرًا جدًا ، يقارب حجم القرد الصغير ، ولكنه بهيئة فيل ، فسأله : ” هل أنت حكيم الغابة بالفعل ؟ ” ، فرد الفيل : ” نعم ، ولا تتعجب من شكلي ، فأنا مرتاح كثيرًا ، وأحمد الله على ذلك ، وعلى الرغم من جسمي ، فأنا لدي عقل حكيم ، لذلك أصبحت حكيم الغابة ، كما ترى فأخبره القرد بأنه يريد ذيلًا طويلًا ، حتى يلعب مع القرود ، رد الفيل قائلًا : ” ولكنك يا أيها القرد ، عندك شيء مميز ، فأنت سريع جدًا ، فلو كان لديك ذيل ، لن تتمكن من الركض بسرعة ” ، فاقتنع القرد ، وحمد الله ، وشكر الفيل ، وأسرع إلى الكلب ، واعتذر له ، وأخبره بأنه لا يريد ذيلًا ، حتى يتمكن من اللعب ، والركض معه",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('( قصة السمكات الثلاث )'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("كانت ثلاث سمكات صديقات تعيش في بركة ، السمكة الأولى جميلة الشكل ، معجبة بنفسها ، ولكنها كانت كسلانة ولا تسعى للحصول على طعامها ، وتقول دائمًا : أنا أحب اللهو واللعب ، ولا أفكر إلا في يومي فقط ، يكفيني من الطعام ما أجده قريبًا من بيتي والسمكة الثانية كانت ذكية لكنها مهملة ، كانت تقول إنها تفهم كل شيء ، وتعرف كيف تتخلص من الخطر في اللحظة الأخيرة ؛ ولأنها تعمل عقلها بسرعة ، وتحسن التصرف ، وتنجو من المصائب في الوقت المناسب أما السمكة الثالثة فكانت عاقلة مدبرة تسعى بنشاط لتحصل على طعامها ، وتعد للأمر عدته ، وتعمل حساب المستقبل ، وتستعد لأي خطر قبل وقوعه ، وفي يوم من الأيام تقابلت السمكات الثلاث في طرف البركة ، ورأت السمكة العاقلة صيادًا قادمًا من بعيد يحمل صنارته وشبكته ، فنبهت صاحبتيها ، وقالت لهما : أرى صيادًا قادمًا ، لا بد أن نحترس ونتحرك بسرعة ضحكت السمكة الجميلة من كلام صاحبتها وسخرت منها وقالت لها : تريدين أن تهربي يا جبانة ! أنا سأنتظر الصياد ، وأكل كل ما يلقيه لنا من طعم ، ولن يتمكن من صيدي أبدًا ، وقالت السمكة الذكية : أنا لا أخاف الصياد ، سأنتظره وأتحداه ، ثم أنصرف متى أشاء. لم تسمع السمكة العاقلة كلام صاحبتيها ، وأسرعت مبتعدة عن البركة وانتقلت إلى الترعة المجاورة ، حضر الصياد وألقى صنارته فاقتربت السمكة المغرورة من الطعم ، وبدأت تأكله بحرصٍ شديد أحس الصياد بالسمكة ، فجذب الصنارة بسرعة ومهارة ، فشبكت في فمها ، ورفعها الصياد إليه ، وأمسك بها وهي تتلوى تريد الخلاص ، ثم وضعها في سلته ، رأت السمكة الذكية هذا المنظر فلم تهتم ، ألقى الصياد الصنارة مرة أخرى وفيها الطعم ، وبينما السمكة الذكية تنظر وتفكر في طريقة تأكل بها الطعم رمى الصياد شبكته عليها ، ولم تستطيع السمكة الهرب جذب الصياد الشبكة بسرعة ، وحاول أن يمسك السمكة الذكية بيده ، فعضته في إصبعه ، وقفزت في الماء بسرعة شديدة ، بعد أن انكسرت إحدى زعانفها ، وأسرعت السمكة الذكية في الهرب ، وأخيرًا وصلت إلى حيث صاحبتها العاقلة وهي تتألم وتلهث من الخوف ، وأخبرتها بما حدث مع صديقتهم السمكة الكسولة ، وأنها كادت تقع في شباك الصياد فقالت السمكة العاقلة : هل عرفت الآن أنني كنت على حق عندما أسرعت بالابتعاد عن البركة ؟ ، لقد خسرت صديقتنا السمكة حياتها بسبب غرورها وكسلها ، وكدت أنت تقعين في يد الصياد بسبب إهمالك ، أتمنى أن تتعلمين من هذا الدرس شيئًا قالت السمكة الذكية : أعترف أنني كنت مخطئة ، ولكن في المرات القادمة يجب أن أعد للأمر عدته ، وأتصرف بسرعة ، ولا أنتظر للحظة الأخيرة",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(قصة صانع الأحذية والأقزام)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("عاش صانع أحذية مع زوجته في منزل فقير ، وكان يقوم بشراء الجلد ويذهب إلى ورشته كل يوم لقص الجلد وحياكة الأحذية ، ثم بيعها في السوق ، وما يحصل عليه من مال ، يقوم بشراء المزيد من الجلد لصنع الأحذية ، ولكن لم يكن صانع الأحذية يربح الكثير من المال ، وظل هو وزوجته يكافحان من أجل لقمة العيش ، وفي النهاية لم يعد لديهم المال لشراء المزيد من الجلد ونفذ كل ما لديهم وبقيت قطعة من الجلد صغيرة ، ونظر لها صانع الأحذية وهو يبكي ، لأنه يعلم ربما تكون تلك المرة هي الأخيرة في صنعه للأحذية ، فأمسك بالقطعة الأخيرة من الجلد وقصها وقرر استكمال العمل بها في صباح الغد وأغلق الورشة وعاد إلى منزله ، وفي صباح اليوم التالي عاد إلى ورشته ، ليكمل صنع الحذاء الأخير ، وما إن فتح باب الورشة حتى وجد على الطاولة حذاء جميل ومزين ، وتعجب صانع الأحذية فكيف حدث ذلك ، وهو لم يكمل العمل عليه منذ الأمس ولكن سرعان ما أمسك بالحذاء ، واتجه به إلى السوق وباعه بمبلغ كبير ، وتمكن من شراء المزيد من الجلد فعاد إلى منزله وهو سعيدًا واخبر زوجته بما وجده ، فتوجه إلى ورشته وأمسك بما اشتراه من جلد ، وقام بقصه وترك أجزاء الجلد المقصوصة على الطاولة وعاد ليكمل عمله في الغد ، ولكنه في اليوم التالي وجد أيضًا تلك القصاصات قد تحولت إلى أحذية رائعة وجميلة ، فجمعها وذهب لبيعها في السوق وربح مال أكثر ، وهكذا ظل صانع الأحذية يقص الجلد ويتركه على الطاولة في الورشة ، وعند الصباح يجده حذاء جميل فيأخذه ويبيعه في السوق ويربح مال أكثر وسرعان ما أصبح صانع الأحذية مشهورًا بأحذيته الجميلة ، وزاد الإقبال عليها ولكن كان صانع الاحذية يود إن يكتشف الشخص الذي يساعده في الخفاء ، فقرر هو وزوجته الاختباء ليلًا في الورشة لانتظار ذلك الشخص وعند منتصف الليل قفز قزمين صغيرين من نافذة الورشة ، وامسكا بالجلد وصنعا أحذية جميلة ملونة ومزينة ، وكانا القزمين يرتديان ملابس قديمة وممزقة وأحذية بالية ، ولكن كانا ماهرين في صنع الأحذية  وما إن أنهى القزمين عملهما حتى رحلا من النافذة ، فقرر صانع الأحذية أن يقدم لهما هدية تعبيرًا عن امتنانه لمساعدتهما له ، فقرر أن يصنع لهما أحذية جديدة تناسبهما ، كما قررت زوجته حياكة ملابس جديدة بدلًا من الممزقة وبالفعل أنهى الزوجين صنع الأحذية والملابس الخاصة بالأقزام ، وتركاها لهما على الطاولة وفي منتصف الليل قفز القزمين إلى النافذة ، لكن لم يكن هناك جلد لحياكته ، بل كانت ملابس وأحذية لهما ، فارتدياها وظلا يرقصان من شدة السعادة وفي اليوم التالي قص صانع الأحذية الجلد ، وتركه على الطاولة وعاد إلى منزله ، ولكن عندما جاء في اليوم التالي وجد الجلد المقصوص كما هو ، فعلم بغياب القزمين وعاد إلى منزله حزينًا ، لكن زوجته شجعته أن يعود هو يصنع الأحذية بنفسه كما كان من قبل ، وأن يجتهد في عمله ويحافظ على ما وصل إليه من شهرة ، وبالفعل عاد صانع الأحذية للعمل في ورشته بكل جهد واجتهاد",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('( قصة الأخوات الثلاثة )'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("كان هناك ذات يوم ثلاثة أخوات صغار وهن دافيتا وبيترا وسيمونا ، وكانت الفتيات تعيشن مع والدتهن في منزلهم بالغابة ، ومرت الأيام وكبرت الفتيات وأصبحن شابات وأصبح المنزل الذي يعيشون به صغير عليهن ، فجمعتهن والدتهن ، وقالت لهم لقد حان الوقت أن تحصل كل واحدة منكن على منزلها الخاص ، وسوف أوزع عليكن المال الذي تركه والدكن ، وعليكن أن تحسنا إنفاقه مثلما كان يفعل والدكن فأخذت كل فتاة نصيبها من المال وسرن في الغابة حتى وجدن مكان فسيح وجميل يصلح ليكون مكان لإقامة منزل ، فقالت دافيتا سوف أقوم بجمع الأخشاب المتوفرة في هذا المكان وأقوم ببناء بيتي ، فقالت لها أختها سيمونا إن الخشب ضعيف ولا يصلح لبناء منزل قوي ، يجب أن تقومي بشراء القرميد لبناء منزلك ولكن دافيتا قالت لأختها أنها ستوفر النقود لشراء حصان وفساتين جميلة ، فقامت بيترا ودافيتا بمساعدتها وجمعوا الأخشاب وبدأن في بناء المنزل ، وبعد أن انتهوا ، طلبوا من دافيتا أن تساعدهما في بناء منازلهما ، ولكنها رفضت ، وقالت أنها سوف تذهب لشراء الحصان وكانت بيترا قد قررت أن تبني منزلها من العشب والقش ، وتشتري بالأموال أثاث فاخر لمنزلها ، فنصحتها أختها سيمونا ببناء منزل من القرميد ، ولكن بيترا رفضت ، فبدأت بيترا وسيمونا تجمعان العشب للمنزل ، وعندما رأتهما دافيتا ضحكت عليهما وقالت لهما إن العشب ليس ملائم لصنع المنزل ، فهو ضعيف سوف يدمره الريح بسرعة ، ثم انصرفت  عندما انتهت بيترا وسيمونا من بناء منزل بيترا كان المساء قد حل ، ولم تكن سيمونا قد اشترت المواد اللازمة لبناء منزلها ، فطلبت من أختها بيترا أن تستضيفها في منزلها حتى تبني منزل خاص بها ، ولكن بيترا قالت لأختها إن منزلها صغير ولا يكفي سوى لفرد واحد فقط ، ودخلت منزلها وأغلقت بابها في وجه أختها التي ساعدتها ، دهشت سيمونا فقد أمضت طوال النهار في مساعدة سقيقاتها والآن تغلق بيترا بابها في وجهها ، وقررت أن تنتظر دافيتا لتبيت في منزلها  عندما عادت دافيتا بعد عدة ساعات لم تكن بمفردها ، ولكنها قد اشترت الحصان وملابس جميلة واصطحبت معها فتاتين أخدرتين ، وقالت لسيمونا هاتي صديقاتي قد تعرفت عليهما في السوق وسوف ينامان معي الليلة ، ودخلت دافيتا إلى منزلها وأغلقت الباب  فاضطرت سيمونا أن تبيت في العراء في الغابة ، ولكنها كانت سعيدة لأنها في الصباح سوف تصطحب أخواتها إلى السوق وتشتري المواد اللازمة لبناء البيت في الصباح طلبت سيمونا من أخواتها أن يساعدنها في بناء منزلها ، ولكنهما كانتا أنانيتين ، ورفضا مساعدة أختهما الصغرى وقد لاحظت سيمونا أن دافيتا بدأت تنفق أموالها على الفتاتين التي تعرفت عليهما في السوق ، فنصحتها أن تحافظ على بعض أموالها لتشتري بها الطعام في فصل الشتاء ، ولكن دافيتا رفضت الاستماع لنصيحة أختها وقالت أنها سوف تشترى لصديقاتها بقرة وعندما تنفق كل أموالها ، فإنها ستقاسم صديقتها في حليب البقرة  بدأت سيمونا تعتمد على نفسها بعد أن رفضت شقيقاتها مساعدتها ، وذهبت لسوق وبدأت تشتري القرميد ، وقد ساعدها أحد المزارعين الطيبين في نقل مواد البناء إلى الغابة ، وظلت طوال الصيف تبني منزلها ، حتى استطاعت في النهاية أن تبني منزل قوي وآمن ولم تكن سيمونا تملك أثاث ولكنها كانت سعيدة بالمنزل ، وقد قررت أن تستثمر باقي أموالها في زراعة الحديقة التي تحيط بمنزلها ، وبالفعل بدأت في حرث الأرض وزراعتها ، بينما كانت دافيتا وبيترا مشغولتان بإنفاق باقي أموالهما وفي أحد ليالي الشتاء ، قامت البقرة التي اشترتها دافيتا بدفع منزلها الخشبي ، فتهدم بالكامل ، فقامت الصديقتين باصطحاب البقرة ومغادرة الغابة ، وظلت دافيتا بلا مأوى أو نقود ، ولم تجد أمامها سوى أختها سيمونا ، فذهبت إليها وطلبت منها أن تستقبلها في منزلها ، وعلى الفور وافقت سيمونا وذات ليلة ممطرة وجدت سيمونا شخصًا يطرق بابها ، فلما فتحت وجدت أختها بيترا ، فقد دمرت الرياح منزلها ، ودمرت أيضًا الأثاث الفاخر الذي قامت بشرائه ، فوافقت سيمونا أن تبقى أختها في منزلها حتى انتهاء الشتاءوذات ليلة ممطرة وجدت سيمونا شخصًا يطرق بابها ، فلما فتحت وجدت أختها بيترا ، فقد دمرت الرياح منزلها ، ودمرت أيضًا الأثاث الفاخر الذي قامت بشرائه ، فوافقت سيمونا أن تبقى أختها في منزلها حتى انتهاء الشتاء وطوال الشتاء كانت سيمونا تعمل بجد في حديقتها بينما رفضت دافيتا وبيترا مساعدتها ، حتى انتهاء الشتاء وخرجت الأختين الأنانيتين إلى السوق ، وعندما عادتا وجدتا ملابسهما في كومة أمام منزل سيمونا ، ولما حاولا الدخول رفضت سيمونا . وقالت أنها استضافتهما طوال الشتاء ، ولكن بعد أن أتى الربيع ، فإن عليهما أن يقوما ببناء منزل خاص بهما وأن يعملا ليحصلا على الطعام ، وكانت سيمونا قد باعت محاصيلها التي زرعتها وأعطتهما النقود وأخبرتهما أنها قد سمحت لهما بالبقاء معها في فصل الشتاء لأن هذا ما يفعله الأخوات ، وأن عليهما أن ينفقا الأموال بحكمة هذه المرة ، وإلا فلن يجدا أي مساعدة بعد ذلك ، فأدركت الأختان أنهما قد أخطأتا في السابق في كل تصرفاتهما وأن أختهما سيمونا كانت على حق من البداية ، وبدأن في شراء القرميد لبناء منزل جديد",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(قصة الراعي الكذاب)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("في قرية صغيرة في سفح الجبل عاش حميد وعمل كراعي لأغنام أهلها ، وفي كل صباح كان حميد يأخذ الأغنام إلى الجبل حتى تأكل العشب وترتع وتعلب هناك ، من ثم يعود بها في المساء إلى القرية ، وفي يوم من الأيام شعر حميد بالملل فأراد أن يرفه على نفسه بالمزاح مع أهل القرية فأخذ يصيح ويستغيث قائلًا النجدة ساعدوني النجدة ساعدوني هناك ذئب يريد افتراس أغنامكم بالطبع هرع سكان القرية لكي ينقصوا على الذئب وينقذوا قطيع الأغنام ، ولكنهم عندما وصلوا سفح الجبل اكتشفوا أن حميد كان يمزح معهم ، فعادوا إلى القرية منزعجين من مزاحة الثقيل وبعد عدة أيام كرر حميد الكرة فأخذ يصيح قائلًا النجدة ساعدوني هناك ذئب يريد افتراس أغنامكم ولما اكتشفوا كذبه غضب أهل القرية منه وصاروا يلقبونه بالكذاب ، وذات يوم بينما كان الراعي في الجبل ، وإذ بذئب كبير وضخم يظهر من بين الصخور ويهجم على الأغنام لكي يفترسها فصاح حميد طالبًا النجدة من أهل القرية وقال النجدة النجدة ساعدوني النجدة ولكن في تلك المرة لم يأت أحد لكي ينقذه واستطاع الذئب أن يفترس الأغنام وخسر حميد عمله وثقة أهل القرية فيه وتعلم حميد أن لا يستعمل الكذب أبدًا ولو مازحًا",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(قصة جزاء الإحسان)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("جزاء الإحسان تدور أحداث القصة عن عمل الخير ، وما يتبعه من مقابل عظيم جزاءً لذلك العمل ، فتتحدث القصة عن شاب خلوق ، قام بشراء طائرين وقرر اطلاق صراحهما ، ليستمتعوا بحرية الحركة في بيئتهما الاجتماعية ، ولأن الطائرين مخلصين وممتنين إلى ما فعله هذا الشاب من خير معهما ، قررا أن يدللاه على مكان فيه خير كثير له ، كما سيلي في القصة كان أحد الشبان يخدم رجلاً من الناس ، ثم فكر الشاب في ترك عمله ، فأعطاه الرجل أجرته وهي جنيهان ، فأراد الشاب أن يتصدق بأحدهما ويبقي الآخر معه وفي اليوم التالي قام الشاب بالذهاب إلى السوق ، ووجد مع أحد الصيادين طائرين من نوع الهدهد ، فساومه فيهما ، فرفض الصياد أن يبيعهما إلا بجنيهين !!.. فحاول الشاب أن يسمح له الصياد ببيعهما له بجنيه واحد ، فامتنع الصياد ثم قال الشاب لنفسه : يمكنني أن أشتري أحد الطائرين بجنيه ، وأترك الآخر ، ثم فكّر وقال : لعلهما يكونان زوجين ، ذكراً وأنثى ، فأفرق بينهما ، فأدركه لهما رحمة ، فتوكل على الله واشتراهما بجنيهين ، وأشفق أن يرسلهما في أرض مزدحمة بكثير من الناس ، وأن يصابا ولا يستطيعا أن يطيرا ، مما لقياه من الجوع والهزال والضعف ففكر قليلًا ثم أخذهما معه ، وذهب بهما إلى مكان كثير المرعى والأشجار ، بعيد عن الناس والعمران ، فأرسلهما وأطلق سراحهما ، فطارا ووقعا على شجرة مثمرة ، فلما صارا في أعلاها ، شكرا له ما قام به نحوهما ، وسمع أحدهما يقول للآخر : لقد خلصنا هذا الشاب الرحيم الشفيق من الورطة التي كنا فيها ، وأنقذنا ونجانا من الهلاك والموت ، ويجب علينا أن نكافئه بفعله الجميل هذا ، ونصنع له نحن أيضاً معروفاً وإن في جذر هذه الشجرة قدر مملئة جنيهات ذهبية ، ويجب أن ندله عليها حتى يأخذها ، فقال الشاب لزوج الهدهد : كيف تدلان إياي على كنز مدفون تحت الشجرة ؟! لم تره العيون وأنتما لم تريا شبكة الصياد الذي اصطادكما فقالا : إن القضاء إذا نزل ، صرف العيون عن موضع الشيء ، وعند القدر يعمى البصر ، وقد غطا القدر أعيننا عن الشبكة فلم نرها ، ولم يغطها عن هذا الكنز فعرفناه ورأيناه سمع الشاب كلامهما ، ثم أخذ الشاب يحفر تحت الشجرة ، حتى وجد إناءً من الخزف ، أخذه وفتحه فرآه مملئا ذهباً ، فشكر الطائرين شكراً جزيلاً ، ودعا لهما بالخير والعافية ، وودعهما مؤمناً بالله إيماناً كاملاً ، راضياً بقضاء الله وحكمته ، متأكداً من عدله",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(قصة البطة المغرورة)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("يعيش مجموعة من البط الرمادي الجميل بالمزرعة ، وكان البط يستيقظ كل صباح ويذهب إلى نهر صغير بجوار المزرعة ، ليسبح ويلعب في سعادة ، وذات يوم أتت البطة البيضاء المغرورة تتباهى بلونها الأبيض والريش الطويل ، وتشعر إنها أجمل من البط ذات اللون الرمادي وكان البط الرمادي قد أعتاد على غرور البطة البيضاء ، وكان لا يهتم بكلامها بل عندما تطلب أن تلعب معه يرفض لأنها مغرورة ، وتظل تردد كلمات الغرور والإعجاب بجمالها ، بل وتقلل من شأن البط الرمادي وتصفه بالقبيح وظلت البطة البيضاء جالسة على شاطئ النهر وتنظر إلى البط الرمادي وهو يلعب ويلهو في الماء ، وجاءت الدجاجة وألقت التحية على البط الرمادي ، فقام البط الرمادي بدعوتها للعب معه خارج البحيرة ، ووافقت الدجاجة ولكن اغتاظت البطة البيضاء ، لأن الدجاجة ذات ريش أسود فكيف يعجب بها البط الرمادي ويدعوها للعب معه أما هي فلا يلعب معها فكرت البطة في حيلة لتجعل لونها يبدو مثل لون الدجاجة السوداء التي يحبها البط الرمادي ، ويدعوها باستمرار للعب معه فأسرعت البطة البيضاء وقفزت في الماء ، ثم خرجت وتدحرجت في كوم من الفحم الأسود ، وبالفعل التصق غبار الفحم في ريش البطة البيضاء فأصبح لونها شديد السواد مثل لون الفحم ، وصار منظرها يخيف كل من يراها تقدمت البطة البيضاء نحو البط الرمادي في البحيرة بعد أن أصبح لونها أسود ، وظنت أن بذلك ستنال رضا البط الرمادي ، وسيوافق مشاركتها في اللعب ، لكن ما إن اقتربت البطة البيضاء حتى ركض البط الرمادي وهو يشعر بالخوف ، ويظنه وحش مخيف متخفي في ثياب بطة حزنت البطة البيضاء وبكت ، وحاولت أن تشرح للبط الرمادي ما فعلته لتنال إعجابه ، ولكنه ظل يركض ورحل عن البحيرة ، فقررت البطة البيضاء أن تستعيد لونها الأبيض ، فقفزت في الماء واغتسلت من غبار الفحم الذي غطى ريشها بالكامل ، وعاد ريشها إلى اللون الأبيض ، واعتذرت لأصدقائها وأخبرتهم إنها لن تتعالى عليهم مرة  أخرى ، وتعلمت البطة درس عظيم ، وهو إنه ليس مهم ما يكون لونك أو شكلك ، ولكن الأهم أن يبقى الأصدقاء يحسنون بعضهم إلى بعض ، ويتشاركون بمحبة دون تعالي أو تكبر",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(قصة أول يوم مدرسة)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("في صباح يوم مشمس جميل ، استيقظت رنيم مبكرًا ، وبدأت تستعد لليوم الأول للمدرسة ، قالت لها أمها وهي تمشط شعرها : لقد أصبحت كبيرة يا رنيم .. تذهبين إلى المدرسة سألت رنيم : هل ستبقين معي في المدرسة كل الوقت يا ماما ؟ ، قالت ماما : سأبقى معك قليلا يا حبيبتي ، ثم أعود لآخذك إلى البيت .. في المطبخ ، قالت رنيم وهي تتناول إفطارها : ما رأيك يا ماما لو أساعدك في أعمال المنزل اليوم ، بدلاً من الذهاب إلى المدرسة ابتسمت ماما وقالت : تساعدينني في أعمال المنزل ! ولكن .. بعد العودة من المدرسة ، في السيارة همست رنيم في إذن ماما : أنا لست كبيرة ، أنا صغيرة ! أريد أن أبقى معك في البيت ، قالت ماما : ستعجبك الروضة يا حبيبتي ، ستلعبين مع الأطفال ، وتتعلمين أغاني حلوة ، وتستمعين إلى قصص جميلة ، أوصلت ماما رنيم إلى الروضة ، وبقيت معها بعض الوقت وعندما حان وقت ذهاب ماما ، صاحت رنيم بأعلى صوتها : لا تذهبي يا ماما ، أبقي معي ، أبقي معي ، أبقي معي ! قالت المعلمة : ستعود ماما قريبا يا رنيم ، ستعود قريبًا بكيت رنيم وهي تقول : سس سس سأنتظر ماما حتى تعود ، في غرفة الصف ، قالت المعلمة : ضعي صندوق الطعام على الرف يارنيم ، قالت رنيم : لا .. لا انني أنتظر ماما أن تعود ، قالت المعلمة : ما رأيك أن تلعبين مع حنين أو أحمد ؟ .. قالت رنيم : لا .. لا انتظر ماما أن تعود ، جلست رنيم على الكرسي ، جلست وجلست وجلست ، فجأة قفز كريم أمام رنيم وقال : أنا وحش مخيف ووووو!!! ضحكت رنيم وقالت : لا لا أنت ولد صغير قال كريم : لماذا تجلسين على الكرسي ولا تلعبين ؟! قالت رنيم : انني .. انني أنتظر ماما أن تعود ، قال كريم : بسيطة ، انتظريها بعد أن نلون بالريشة والألوان ، وضعت رنيم صندوق الطعام الأصفر الجديد على الرف ، ولونت رسمة جميلة بالأصفر والأحمر والأزرق ثم خرجت إلى الحديقة لتلعب مع حنين وأحمد وكريم ، لعبت رنيم ، لعبت ولعبت ولعبت .. وبعد الانتهاء من اللعب ، جلست رنيم مع الأطفال على السجادة للاستماع إلى قصة .. فجأة دق الباب وفتح !!… من حضر إلى الصف يا ترى ؟! افتحوا الباب لتعرفوا",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(قصة مغامرة في المزرعه)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("تدور أحداث القصة حول صديقتان هما زينب وزران ، عندما دعت زينب ، صديقتها رزان إلى المزرعة ، لتقضية يوم في العطلة معها هي وأسرتها ، ووافق والدي رزان على ذهابها ، وفي المزرعة تعرفت رزان على حيوانات أليفه كثيرة ، ولعبت الكرة مع زينب وطارق ، ولكن عند بركة السباحة ، في المزرعة ، حدث ما لا يحمد عقباه في صباح أحد أيام عطلة الصيف ، دعت زينب صديقتها رزان لقضاء يوم معها ، ومع عائلتها في المزرعة ، وفرحت رزان فرحاً شديداً ، عندما وافق أباها وأمها للذهاب ، عند صديقتها في المزرعة ، وأسرعت لتحضر حقيبتها وصلت رزان إلى المزرعة ، ووجدت في المزرعة حيوانات أليفة وكثيرة ، جمعت زينب ورزان البيض الطارج ، من عند الدجاجات ، ثم أطعمتا البط والدجاج ، ثم بعدها ذهبتا مع الخروف الصغير والأرانب ولكن عندما اقتربت رزان من الكلب سمور نبح بصوت عالي لأنه لا يعرفها ، فخافت رزان كثيراً من صوته واختبأت وراء زينب ، وقالت لصديقتها زينب : أنا أخاف من سمور ، فقالت زينب بحزم لسمور : هذه صديقتي رزان يا سمور لا تنبح عليها ، فسكت سمور عن النباح ونظر إلى رزان مستعطفا اياها ألا تخاف منه لعبت زينب ورزان مع طارق أخو زينب ، كرة القدم ، فركل طارق الكرة عالياً ، وهو يصيح بصوت ، عالي جوووون ، ولكن الكرة تدحرجت بعيدا بعيدا ً، ووقعت في بركة السباحة فقال طارق يا الهي ، من نسي باب البركة مفتوحاً وضع طارق يده في بركة السباحة ، محاولاً التقاط الكرة ، ولكنه وقع في البركة ، وصار يخبط بيديه في الماء ويصرخ فهرعت زينب إلى البيت بأقصى سرعة لديها ، وهي تصيح بأعلى صوت منادية على أبيها وأمها ، قائلة : بابا ، ماما فأسرعا ، وقع طارق في بركة السباحه وسوف يغرق ، أسرعا أسرعا ، وما هي إلا لحظات ، حتى وصل أبيها وأمها ، إلى بركة السباحة ، ووجدا طارق خارج بركة السباحة ، يرتجف من البرد ، فقالت الأم عندما رأت طارق خارج البركة : الحمد لله أنك بخير يا حبيبي ، الحمد لله ، فقال طارق مرتجفاً متلعثماً : رزان ، رزان ، هي التي أخرجتني من بركة السباحة صاح الجميع : رزان ، شكرًا شكرًا لكي يارزان على ما فعلتيه ، ولكن كيف أخرجت طارق من بركة السباحة ، فضحكت رزان وشرحت لهم كيف أخرجت طارق من بركة السباحة ، وقالت : التفت خلفي ، فوجدت عصا أمامي ، فمددت له عصا ، فأمسك بها جيداً ، وسحبت العصا حتى أخرجته منها بسلام  ",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(مواقف من حياة القاضي شريح)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("كان أمير المؤمنين عمر بن الخطاب رضي الله عنه في يوم من الأيام يريد شراء الفرس الذي سينتقل به ؛ فاشتراه من رجل من الأعراب وأعطاه الثمن ، ولمَّا امتطاه ومضى به طويلًا رأى أن به عطبًا يعيقه عن مواصلة السير ؛ فرجع به من حيث انطلق وأعطاه للرجل ، وأخبره أنه معطوب فما كان من الرجل إلا أن قال : لا آخذه يا أمير المؤمنين وقد سلمته لك غير معطوب ، فطلب منه أمير المؤمنين رضي الله عنه أن يُحَكِّم بينهم رجلًا ؛ فاحتكم الرجل بشريح بن الحارث ، فرضي أمير المؤمنين رضي الله عنه به وعندما احتكموا بالرجل سألهم عن حال الفرس وهل كان معطوبًا عند الشراء أم لا ؛ فأجابه أمير المؤمنين أنه كان سليمًا غير معطوب ، فحكم لهم بعدم رده إلى صاحبه ، وقال له احتفظ بما شريت يا أمير المؤمنين أو رده كما أخذته ، فأُعجب به أمير المؤمنين رضي الله عنه وبعدله ، وولاه قضاء الكوفة يُحكى أنه في صغره اصطحبه والده في إحدى أسفاره وأثناء الطريق لم يقبل الأطفال المرافقين له أن يلعب معهم ؛ فأعرض عنهم وبقي للعب بمفرده ، وعندما رأه أبوه بعيدًا خاف عليه أن يختطفه قطّاع الطرق فنهره عن الذهاب بعيدًا عن القافلة وعندما رأى الأطفال ذلك جلسوا يضحكون منه ثم قاموا بخداعه عن طريق إخباره بالاختباء في المكان الذي نهره أبوه عنه ليأتوا هم إليه للعب ، ثم ذهبوا لأبيه وأخبروه أنه قد عصاه ؛ فذهب إليه أبوه وبدأ بضربه ولم يصدقه عندما أقسم إليه أنه مظلوم ، فأثَّر فيه أن المظلوم يحتاج إلى إنصاف عندما لا يجد دليلًا ولا شاهدًا ولم يكن ذلك القاضي العادل عند توليته مجهولًا عند أهل العلم وأصحاب المقام والرأي في المجتمع المدني من أجلة الصحابة وكبار التابعين ، وكان رجلًا يمني الموطن ، وقضى شطرًا من حياته في الجاهلية ؛ فعندما أشرقت الجزيرة العربية بنور الهداية كان من أوائل المؤمنين بدعوة الرسول صلَّ الله عليه وسلم ولم يكن أمير المؤمنين رضي الله عنه متعجلًا في اختباره لذلك المنصب الرفيع مع تألق سماء الإسلام يومئذ بالنجوم من الصحابة ، فقد أثبتت الأيام صدق فراسة عمر وصواب تدبيره ، إذ ظل يقضي بين المسلمين ما يقارب الستين عامًا متتابعة من غير انقطاع ، وقد تعاقب على إقراره في منصبه كل من عمر وعثمان وعلي ومعاوية رضوان الله عليهم أجمعين كما أقره على ذلك من جاء بعد معاوية بن أبي سفيان من خلفاء بني أمية حتى طلب إعفاءه من ذلك المنصب ، وقد بلغ السابعة بعد المائة من حياته الحافلة بالمفاخر والمآثر ومن المواقف التي تشهد بنزاهته الشديدة أنه في يوم من الأيام جاءه ولده وشرح له خصومة بينه وبين قوم من الأقوام وقال له : إن كان الحق لي قاضيتهم وإن كان لهم صالحتهم ، ولمَّا قصَّ عليه قصته قال له : انطلق فقاضهم وعندما مضى إلى خصومه ودعاهم للقضاء واستجابوا له ومثلوا بين يدي القاضي قضى هم على ولده فما كان من الولد بعد ذهبوا لبيتهم إلا أن قال : فضحتني يا أبتي ، والله لو لم أستشرك من قبل ما لمتك أبدًا فقال له قاضينا العادل : إنك يابني أحب إلي من ملء الأرض من أمثالهم ، ولكن الله عزَّوجل أعزَّ علي منك ، لقد خشيت أن أخبرك بأن الحق لهم ؛ فتصالحهم صلحًا ينقص عليهم بعض حقهم فقلت لك ما قلت وقد كفل يومًا ولدًا من أولاده رجلًا وعندما قبل كفالته ما كان من الرجل إلا أن هرب من يد القضاء ، فتم سجن ابن القاضي مكان الرجل الفار ، فكان ينقل له الطعام بنفسه كل يوم إلى السجن وفي عمر السابعة بعد المائة وبعد استقالته من منصبه بشهر واحد مات التابعي الجليل بعد أن أقام في الناس العدل ، وكان مثالًا يُحتذى به في العدل والاستقامة  ",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
              Container(
                margin:EdgeInsets.only(bottom: 45),
                padding:EdgeInsets.only(right: 10,left: 5),
                child: Column(
                  children: <Widget>[
                    Image.asset('images2/atfal2.jpg'),
                    Text('(وصايا الرسول على الجار)'
                      ,style:TextStyle(fontSize: 30,fontWeight: FontWeight.bold,color: Colors.red),
                      textDirection: prefix0.TextDirection.rtl,),
                    Text("لقد أوصى الرسول صلّ الله عليه وسلم على الجار وأكد على عدم إيذائه ؛ فكان صلى الله عليه وسلم نعم الجار الذي يُحسن إلى جاره ويكرمه ، ولم تقتصر وصاياه على الجار المسلم فقط ؛ بل إنه كان بارًا بجاره اليهودي أيضًا وأوصى على كل الجيران حتى لو لم يكونوا من المسلمين تعلم الصحابة الإحسان إلى الجار من خلال وصايا الرسول صلى الله عليه وسلم ؛ حيث ورد عن عبد الله بن عمرو أنه قام بذبح شاه فقال: أَهْدَيْتُمْ لِجَارِي الْيَهُودِيِّ ، فَإِنِّي سمعت رَسُولَ اللَّهِ ﷺ يقول:ما زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حتى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ» كان الرسول صلى الله عليه وسلم يمتاز بالخلق الحسن في كل صفاته وتعاملاته مع الآخرين ؛ فكان قرآنًا يمشي على الأرض يقدم للناس الخير والإحسان ، وقد ربط الرسول الكريم بين الإيمان بالله وبين إكرام الجار وأوضح ذلك من خلال قوله صلى الله عليه وسلم : وَمَنْ كان يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ…» (متفق عليه) كان الرسول صلّ الله عليه وسلم يذهب ليعود جيرانه حينما يعلم بمرض أحدهم ، وقد أخبر زيد بن ثابت رضي الله عنه أنه كان جارًا لرسول الله الذي بمجرد أن علم بمرضه ذهب إليه ليطمئن عليه ، وقد ورد عن زيد بن أرقم رضي الله عنه أيضًا قوله عن زيارة الرسول له للاطمئنان عليه في مرضه حيث قال :”عادني رسول الله صلى الله عليه وسلم من وجع كان بعيني” ، وقد أوضح الرسول الكريم معايير الخير التي يجب أن تتوفر في المسلم في قوله صلى الله عليه وسلم : وَمَنْ كان يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ…» (متفق عليه) قام الرسول صلّ الله عليه وسلم بتحذير المسلمين من قطيعة الجيران لأنهم سيختصمون يوم القيامة أمام المولى عز وجل ؛ حيث ورد عن ابن عمر أنه قد سمع الرسول صلّ الله عليه وسلم يقول : كَمْ مِنْ جَارٍ مُتَعَلِّقٌ بِجَارِهِ يَوْمَ الْقِيَامَةِ يَقُولُ: يَا رَبِّ ، سَلْ هَذَا لِمَ أَغْلَقَ بَابَهُ دُونِي وَمَنَعَنِي فَضْلَهُ أوصى الرسول صلّ الله عليه وسلم أيضًا بالإحسان إلى الجار بطريقة التودد إليه بتقديم الطعام ؛ وذلك من أجل ربط أواصر المحبة والعلاقات الطيبة ، وقد تحدث أبو ذر الغفاري رضي الله عنه عن وصية الرسول بهذا الأمر حيث قال : إن خليلي ﷺ أوصاني: «إِذَا طَبَخْتَ مَرَقًا فَأَكْثِرْ مَاءَهُ ُ، ثُمَّ انْظُرْ أَهْلَ بَيْتٍ مِنْ جِيرَانِكَ ، فَأَصِبْهُمْ مِنْهَا بِمَعْرُوفٍ» (رواه مسلم) نهى الرسول صلّ الله عليه وسلم عن إيذاء الجار وشدّد على ذلك الأمر حتى أقسم ثلاث مرات في قوله صلّ الله عليه وسلم : والله لَا يُؤْمِنُ ، والله لَا يُؤْمِنُ ، والله لَا يُؤْمِنُ. قِيلَ: وَمَنْ يا رَسُولَ اللَّهِ؟ قال: الذي لَا يَأْمَنُ جَارُهُ بوائقه ، بل أكد الرسول الكريم أن الأعمال الصالحة قد تزول بأكملها إذا حدث إيذاء صاحب هذه الأعمال لجاره حيث ورد عن أبي هريرة رضي الله عنه قوله : «قال رَجُلٌ يا رَسُولَ اللَّهِ ، إنَّ فُلانَةَ يَذْكُرُ مِنْ كَثْرَةِ صَلاتِهَا وَصِيَامِهَا وَصَدَقَتِهَا غَيْرَ أَنَّهَا تُؤْذِي جِيرَانَها بِلِسَانِهَا ، قال: «هِيَ فِي النَّارِ» قال: يا رَسُولَ اللَّهِ فإن فُلانَةَ يذكر من قِلَّةِ صِيَامِهَا وَصَدَقَتِهَا وَصَلاتِهَا وإنها تَصَدَّقُ وَلا تؤذي جِيرَانَهَا بِلِسَانِهَا ، قال: «هي في الْجَنَّةِ” أكد رسول الله صلّ الله عليه وسلم أيضًا أن الجار أولى بالحصول على المنفعة من جاره ، وقد ورد ذلك حينما جاء رجل إلي سعد بن أبي وقاص قائلًا :يا سعد بن أبي وقاص ، ابْتَعْ مِنِّي بَيْتَيَّ في دَارِكَ ، فقال سَعْدٌ: والله ما أَبْتَاعُهُمَا ، فقيل له: والله لَتَبْتَاعَنَّهُمَا ، فقال سَعْدٌ: والله لَا أَزِيدُكَ على أَرْبَعَةِ آلَافٍ مقسطة ، فقال الرجل لقد أُعْطِيتُ بها خمسمائة دِينَارٍ ، وَلَوْلَا أَنِّي سمعت النبي ﷺ يقول: «الْجَارُ أَحَقُّ بِسَقَبِهِ» [القرب والمجاورة] ما أَعْطَيْتُكَهَا بِأَرْبَعَةِ آلَافٍ ، وأنا أُعْطَى بها خَمْسُمِائَةِ دِينَارٍ فَأَعْطَاهَا إِيَّاهُ» (رواه البخاري) وقد تحدثت السيدة عائشة رضي الله عنها مع رسول الله صلّ الله عليه وسلم بأمر الجيران في قولها معه : يا رَسُولَ اللَّهِ إِنَّ لي جَارَيْنِ فَإِلَى أَيِّهِمَا؟» قال: «إلى أَقْرَبِهِمَا مِنْكِ بَابًا» (رواه البخاري) ، وهكذا كانت وصايا الرسول على الجار عديدة وواضحة وتهدف إلى المحبة التي تقيم مجتمعات صالحة ",
                      style:TextStyle(fontSize: 23),textDirection: prefix0.TextDirection.rtl,),
                  ],),
                color: Colors.white,),
            ],
          )
        ),

    ],
      ) );
  }
}

